import 'package:techno_saz/models/data_models.dart';
import 'package:techno_saz/res/paths.dart';
import 'package:techno_saz/res/strings.dart';

class Data_Class {
  static Map homePagePosterMap = {
    "imageAsset": Adress.banner,
    "titleOnBanner": Strings.titleOnBanner,
  };

  static List<HashTagModel> tagList = [
    HashTagModel(title: "جاوا"),
    HashTagModel(title: "کاتلین"),
    HashTagModel(title: "وب"),
    HashTagModel(title: "سلامتی"),
    HashTagModel(title: "هوش مصنوعی"),
    HashTagModel(title: "دارت"),
    HashTagModel(title: "فلاتر"),
    HashTagModel(title: "تکنولوژی"),
    HashTagModel(title: "هنر"),
    HashTagModel(title: "ورزش"),
    HashTagModel(title: "بیزنس"),
  ];

  static List<ArticlePageModel> ArticlePageModelList = [
    ArticlePageModel(
        idArticleUr: "1",
        imageArticleUr: Adress.articlesImageidOne,
        titleArticleUr: """
رژیم 15 روز تا سلامتی استاد جمشید خدادادی
""",
        writerProfilePhotoUr: Adress.writersImageOne,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr: """
باانجام یک رژیم پانزده روزه می توانیداز بیشتر بیماریها نجات پیدا کنید و سلامتی و نشاط خود را بدست آورید و طعم سلامتی جسم و روح را بچشید!اگر رژیم پانزده روزه زیر را دقیقا انجام دهید، با نتایج خیره کننده ای مواجه شد و اثرات فوق العاده مفید آن را به چشم خواهید دید.از این رژیم برای لاغری و تناسب اندام نیز می توان استفاده کرد.با این رژیم، در عرض پانزده روز حدود 4 تا 5 کیلو گرم وزن کم خواهید کرد و پوستی روشن و چهره ای با نشاط پیدا خواهید نمود. و مهمتر از همه، آرامش جالب و خواب عمیق و راحتی پیدا خواهید کرد و از زندگی لذت خواهید برد. حسن این رژیم این است که از غذاهای متنوعی برخوردار است و هر روز غذای مخصوصی میل خواهید کرد؛ زیرا تنوع در غذا باعث می شود که کلیه مواد غذایی لازم به بدن برسد و انسان از فقر غذایی نجات پیدا کند و از مغزی فعال و روانی سالم و جسمی سبک برخوردار شود. امید است با رعایت موارد ذیل سلامتی و نشاط را برای خود به ارمغان بیاورید. افرادی که دچار یبوست مزاج هستند نیز می توانند توصیه های زیر را دقیقا انجام دهند تا از این معضل که خود ام الامراض است نجات پیدا کنند.
 """,
        likedArticleUr: "65",
        commentArticleUr: "5",
        writersName: "هری پاتر"),
    ArticlePageModel(
        idArticleUr: "2",
        imageArticleUr: Adress.articlesImageidTwo,
        titleArticleUr: """
عسل دارویی چیست و چه تفاوتی با عسل معمولی دارد؟
""",
        writerProfilePhotoUr: Adress.writersImageTwo,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "10" + Strings.minutes,
        ContentArticleUr: """
عسل دارویی یا عسل طبی اهمیت زیادی برای بدن انسان دارد. این نوع عسل به عنوان یک ملین خفیف، سوء هاضمه و عفونت های روده ای، درمان بسیاری از ناراحتی های معده از جمله یبوست محسوب می شود. عسل دارویی دارایی ویژگی هایی است که آن را از عسل معمولی متمایز می کند.

در واقع عسل یک ماده غذایی طبیعی با طعم شیرین با بافت چسبناک است. زنبورها این عسل را از شهد گلها که ترشحات شیرین گیاهی است تولید می کنند.

این کار از طریق فرآیندهای مرتب انجام می شود و شکل نهایی پس از تبخیر آب به وجود می آید و عسل در ساختارهایی که به ساختارهای مومی معروف هستند ذخیره می شود و به این ساختارها لانه زنبوری می گویند.

همچنین زنبورها یک نوع عسل تولید نمی‌کنند، بلکه انواع زیادی را تولید می‌کنند که از نظر رنگ، طعم و بو متفاوت است، همه بر اساس منبع غذای زنبور عسل.

به دلیل افزایش تقاضا برای عسل به دلیل خواص و فواید فراوان، مقادیر زیادی زنبور عسل در سراسر جهان پرورش می‌یابد. در این مقاله به خواص عسل دارویی می پردازیم.

تفاوت عسل دارویی با عسل معمولی چیست؟
خواص درمانی عسل تا حدود زیادی به منبع گلی بستگی دارد که زنبورها شهد و گرده را از آن برداشت می کنند. یکی از دلایلی که عسل دارویی را از دیگر عسل ها متمایز می کند منشا گل آن است.

عسل دارویی به طور طبیعی کدرتر از عسل معمولی است؛ زیرا بقایای لانه زنبوری آنقدر کوچک است که فیلتر نمی شود.

همچنین این عسل نسبت به عسل معمولی از نظر رنگ و بافت تنوع بیشتری دارد. رنگ عسل طبی ممکن است بسته به گل هایی که زنبورها گرده افشانی کرده اند، تغییر کند. برخی مطالعات نشان می دهد که عسل دارویی ممکن است فواید سلامتی بیشتری نسبت به عسل معمولی داشته باشد.

انواع عسل دارویی
عسل با توجه به منابع شهد گلی که زنبورها از آن تغذیه می کنند متفاوت است و بر این اساس انواع عسل به شرح زیر طبقه بندی می شوند:

عسل تک گل
عسل تک گل انواع زیادی دارد و این انواع از نظر رنگ و طعم با هم تفاوت دارند، زنبورداران برای تولید عسل تک رنگ، کندوها را در مکانی نگهداری می کنند که زنبورها فقط برای یک نوع گل از آن عبور کنند.

عسل چند گل
عسل چند گل یا عسل گل وحشی از انواع مختلف گل ها استخراج می شود.

عسل مخلوط
این عسل از اختلاط انواع عسل تهیه می‌شود و انواع عسل‌هایی که مخلوط شده‌اند از نظر رنگ، طعم، تراکم، منشاء جغرافیایی و منبع گل متفاوت هستند.
 """,
        likedArticleUr: "84",
        commentArticleUr: "78",
        writersName: "اَ.ویلسون"),
    ArticlePageModel(
        idArticleUr: "3",
        imageArticleUr: Adress.articlesImageidThree,
        titleArticleUr: """
کنترل همروندی چیست؟ 
""",
        writerProfilePhotoUr: Adress.writersImageThree,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "14" + Strings.minutes,
        ContentArticleUr: """
در فناوری اطلاعات و علوم رایانه‌ای، به‌خصوص در شاخه‌های برنامه‌نویسی رایانه‌ای، سیستم عامل، چندپردازشی، و پایگاه‌داده‌ها، کنترل همروندی (به انگلیسی: Concurrency Control)، از نتایج تولید شده ناشی از عملیات هم‌زمان اطمینان حاصل کرده، درحالی که سعی می کند در سریع ترین زمان ممکن به نتایج برسد.
سیستم‌های رایانه‌ای، چه نرم‌افزاری و چه سخت‌افزاری، شامل ماژول‌ها یا مؤلفه‌هایی اند. هر مؤلفه به گونه‌ای طراحی شده که به طرز صحیحی عمل کند، یعنی، از قوانین سازگاری بخصوصی تبعیت نموده، یا با آن ها تطابق داشته باشند. هنگامی که مؤلفه‌های هم‌روند با یکدیگر به وسیله پیام‌دهی یا اشتراک‌گذاری داده‌های دسترسی شده برهمکنش کنند (در حافظه یا محل ذخیره‌سازی)، هم‌روندی برخی از مؤلفه‌ها ممکن است توسط مؤلفه‌های دیگری مورد تجاوز و تخطی قرار گیرد. به طور کلی، مبحث هم‌روندی به ارائه قواعد، روش‌ها، روش‌شناسی‌های طراحی و نظریاتی می پردازد که به حفظ سازگاری مؤلفه‌های هم‌روندی، طی اجرای عملیاتشان کمک کند؛ بدین طریق سازگاری و صحت کل سیستم حفظ خواهد شد. معرفی کنترل هم‌روندی به یک سامانه، به معنای اعمال محدودیت‌های عملیاتیست که اغلب منجر به کاهش یافتن برخی از کارایی‌های سامانه می گردد. دستیابی به سازگاری عملیاتی و صحت باید تا حد امکان همراه با بهره‌وری باشد، به گونه‌ای که کارایی از حد معقول خاصی کمتر نشود. ممکن است کنترل همروندی در مقایسه با الگوریتم‌های سری (Sequential Algorithms) (که ساده‌ترند) نیازمند افزودن به پیچیدگی و سربار در قالب یک الگوریتم همروندی باشد.
به عنوان مثال، شکست در کنترل هم‌روندی، ممکن است منجر به خراب‌شدن داده‌ها شود، که ناشی از گسست عملیات خواندن یا نوشتن است.
 """,
        likedArticleUr: "96",
        commentArticleUr: "23",
        writersName: "شایرا"),
    ArticlePageModel(
        idArticleUr: "4",
        imageArticleUr: Adress.articlesImageidFour,
        titleArticleUr: """
هوش احساسی چیست؟
""",
        writerProfilePhotoUr: Adress.writersImageFour,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "13" + Strings.minutes,
        ContentArticleUr: """
در ابتدا بهتر است یک تعریف کلی از هوش هیجانی ارائه کنیم. هوش احساسی یا هوش هیجانی به انگلیسی Emotional Intelligence، به توانایی شناسایی و مدیریت احساسات خود و احساسات دیگران اشاره دارد. در واقع هوش هیجانی به معنای توانایی مهار احساسات و به کار بردن آنها در کارهایی مانند تفکر و حل مسئله است.

امروزه از هوش هیجانی به عنوان یکی از مؤلفه‌های ذاتی موفقیت در افراد یاد می‌شود. پیش‌بینی و درک رفتار دیگران به ما کمک می‌کند تا در مواقع ضروری بهترین تصمیم را بگیریم. بنابراین مهم است که بدانیم هوش عاطفی چیست و چه مؤلفه‌هایی را در برمی‌گیرد؟

توانایی درک احساسات دیگران و مدیریت احساسات خود می‌تواند منجر به کاهش استرس، برقراری ارتباط موثر، همدلی با دیگران، غلبه بر چالش‌ها و خنثی کردن تعار‌ض‌ها شود. هوش عاطفی یا ای کیو به شما کمک می‌کند تا روابط قوی‌تری ایجاد کنید، در مدرسه و محل کار موفق شوید و به اهداف شغلی و شخصی خود برسید. همچنین به شما کمک می‌کند تا با احساسات خود ارتباط برقرار کنید و تصمیمات آگاهانه‌ای در مورد آنچه برای شما مهم است بگیرید.  

ریشه های تئوری هوش هیجانی (هوش هیجانی در روانشناسی)
اگر بخواهیم تاریخچه هوش هیجانی را به زبان ساده بازبینی کنیم، تئوری هوش هیجانی توسط پیتر سالووی و جان دی مایر در دهه ۱۹۹۰ معرفی شد و به وسیله دانیل گولمن بیشتر توسعه یافت و به عموم مردم ارائه شد. به گفته گلمن، هوش عاطفی بزرگ‌ترین پیش‌بینی‌ کننده موفقیت در محیط کار است. این مفهوم که به عنوان ضریب احساسی یا EQ نیز شناخته می‌شود، در سال‌های اخیر بیشتر مورد توجه قرار گرفته و مقبولیت گسترده‌ای در بین روانشناسان پیدا کرده است.

با این حال، برخی از روانشناسان معتقدند از آنجایی که EQ را نمی‌توان از طریق آزمون‌های روان سنجی مثل انواع تست هوش عمومی مورد ارزیابی قرار داد، این مفهوم فاقد قدرت توضیحی واقعی است. اما برادبری و گریوز توانستند با طرح پرسشنامه‌ای، این مشکل را حل کنند و توانایی ارزیابی آن را نیز به دست آورند. ادوارد تورندایک از روانشناسانی است که در حوزه هوش احساسی تحقیقاتی انجام داد و به نتایجی در مورد اثبات وجود آن دست یافت.

دکتر بار-ان از دیگر افرادی بود که حدود ۲۰ سال از وقت خود را صرف معرفی شیوه‌ای برای اندازه‌گیری EI کرد. بار-ان در طول این مدت مطالعاتی را بر روی بیش از ۱۱۰۰۰۰ نفر در سراسر جهان انجام داد. تست ای کیو بار-ان (آزمون هوش هیجانی بار آن) رفتار هوش هیجانی و اجتماعی را اندازه‌گیری می‌کند. این تست ۱۳۳ آیتم را بر اساس پنج شاخص مورد بررسی قرار می‌دهد.
 """,
        likedArticleUr: "84",
        commentArticleUr: "14",
        writersName: "وانتونز"),
  ];

   static List<ArticlePageModel> MyArticlePageModelList = [
    ArticlePageModel(
        idArticleUr: "1",
        imageArticleUr: Adress.myArticlesImageIdOne,
        titleArticleUr:
            "آی‌مک پرو 32 اینچی احتمالاً تا سال 2025 معرفی نخواهد شد ",
        writerProfilePhotoUr: Adress.writersImageOne,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr: """
آی‌مک پرو قبلی اپل در سال 2017 معرفی شد و پردازنده اینتل زئون داشت. با توجه به اینکه تمامی خانواده‌ مک‌‌، ازجمله مک پرو به چیپست‌های سری M تجهیز شدند؛ احتمالاً کامپیوتر «All in One» اپل نیز به این پردازنده مجهز شود. به نظر می‌رسد که اپل همچنان درحال کار روی این مدل است و انتظار نمی‌رود تا سال 2025 از آن رونمایی کند. همچنین احتمال دارد اپل آی‌مک پرو جدید را با پنل مینی ال‌ای‌دی ارائه دهد.
به گفته مینگ-چی کو، تحلیلگر اپل، آی‌مک پرو قبلی که نمایشگر 27 اینچی رتینا داشت، طبق شایعه‌ای به یک پنل مینی ال‌ای‌دی 32 اینچی ارتقا پیدا می‌کند. کو پیش‌بینی کرده بود که آی‌مک پرو همراه با دیگر آی‌مک‌ها معرفی و عرضه شود، اما به نظر می‌رسد معرفی آی‌مک پرو تا سال 2025 رخ نخواهد داد.

همچنین طبق گفته مارک گرمن، خبرنگار بلومبرگ، اپل مدتی است مشغول ساخت آی‌مک 24 اینچی با تراشه M3 است. اما او احتمال می‌دهد که ساخت آی‌مک پرو 32 اینچی زود باشد.
 """,
        likedArticleUr: "65",
        commentArticleUr: "5",
        writersName: "جک بندر"),
    ArticlePageModel(
        idArticleUr: "2",
        imageArticleUr: Adress.myArticlesImageIdTwo,
        titleArticleUr: """
تصویر روز ناسا: غبار و سحابی پرده غربی""",
        writerProfilePhotoUr: Adress.writersImageTwo,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "10" + Strings.minutes,
        ContentArticleUr: """
سحابی پرده حدود 15,000 سال پیش با انفجار ستاره‌ای در صورت فلکی قو یا دجاجه (Cygnus) ایجاد شد. این انفجار پرشکوه به مدت یک هفته حتی درخشان‌تر از ناهید به‌نظر می‌رسید، اما هیچ گزارشی از آن وجود ندارد. این تصویر، ضلع غربی ابر گازی درحال انبساط را نشان می‌دهد. رشته‌های گازی چشمگیر ازجمله سحابی جاروی جادوگر در بالا سمت چپ نزدیک ستاره درخشان پیش‌زمینه 52 ماکیان (52 Cygni) مشاهده می‌شود و Fleming's Triangular Wisp (که قبلاً با نام مثلث پیکرینگ (Pickering's Triangle) شناخته می‌شد) به‌صورت مورب در وسط تصویر قرار دارد.
      غبار قهوه‌ای بازتابنده‌ که به‌صورت عمودی در سمت چپ تصویر مشاهده می‌شود، احتمالاً در جو خنک ستارگان پرجرم ایجاد شده است. این غبار به‌ندرت در تصاویر ثبت می‌شود، اما در نوردهی طولانی این تصویر در میان نوارهای رنگی متعدد می‌توان آن را دید.
 """,
        likedArticleUr: "84",
        commentArticleUr: "78",
        writersName: "آ.آدام"),
    ArticlePageModel(
        idArticleUr: "3",
        imageArticleUr: Adress.myArticlesImageIdThree,
        titleArticleUr: """
معرفی برنامه Photo Lab
""",
        writerProfilePhotoUr: Adress.writersImageThree,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "14" + Strings.minutes,
        ContentArticleUr: """
ظهور هوش مصنوعی باعث شده است که مدل‌ها و ابزارهای متفاوتی ساخته شوند که هرکدام قابلیت‌های منحصر‌به‌فرد خود را دارند. در این مطلب از دیجیاتو به سراغ برنامه Photo Lab Picture Editor & Art می‌رویم که با کمک هوش مصنوعی می‌تواند تصاویر جذابی براساس چهره شما بسازد.
برنامه اندروید Photo Lab Picture Editor & Art توسط Linerock Investments LTD در گوگل پلی منتشر شده و تاکنون هیچ نسخه‌ای از آن برای سیستم‌عامل iOS منتشر نشده است. این برنامه به‌صورت کاملاً رایگان قابل دانلود و استفاده است؛ هرچند در طول کارکردن با آن تبلیغات نسبتاً زیادی نمایش داده می‌شود.
با کمک این برنامه می‌توانید عکس‌های خودتان را با طیف گسترده و متنوعی از فیلترهای تصویر ویرایش کنید تا به‌عنوان یک خروجی، تصویری از خود در قالب یک کاریکاتور با موضوعات مختلفی داشته باشید.

ازجمله قابلیت‌های این ویرایشگر عکس هوش مصنوعی می‌توان به امکان اضافه‌کردن متن روی عکس‌ها، وجود بیش از 500 افکت متنوع، امکان ساخت عکس‌های کلاژ، امکان طراحی کارت پستال و درنهایت به‌اشتراک‌گذاری عکس‌ها در شبکه‌های اجتماعی اشاره کرد. البته باید اشاره کرد که خروجی نهایی همراه با یک واترمارک ارائه می‌شود که برای حذف آن باید اشتراک برنامه را خریداری کرده یا از نسخه‌های ماد‌شده موجود در اینترنت استفاده کنید.
 """,
        likedArticleUr: "96",
        commentArticleUr: "23",
        writersName: "دنیا"),
    ArticlePageModel(
        idArticleUr: "4",
        imageArticleUr: Adress.myArticlesImageIdFour,
        titleArticleUr: """
۱۵ بازی شبیه‌ساز اتومبیل‌رانی برتر""",
        writerProfilePhotoUr: Adress.writersImageFour,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "13" + Strings.minutes,
        ContentArticleUr: """
خودروبازها همیشه دستشان برای انتخاب شبیه‌ساز چندان بسته نبوده و بسیاری از استودیوها و ناشران حداقل یک ویدیوگیم خودرو محور در کارنامه خود به ثبت رسانده یا قصد دارند در اختیار مخاطب بگذارند. باتوجه به تفاوت سلایق، سعی کردیم دسته‌بندی براساس کاربرد شبیه‌سازهای خودرومحور را درنظر بگیریم و پیشنهادهای باکیفیت را ضمن ذکر نکات مثبت و منفی هر یک معرفی کنیم. به طور کلی چهار دسته‌بندی در این مقاله پیش‌روی شماست؛ دسته اول شامل نمونه‌هایی که برای تجربه آنلاین بهترین گزینه به حساب می‌آیند، دسته دوم شبیه‌سازهایی که برای انجمن‌ها و کامیونیتی‌ها بهترین فضا را ایجاد کردند، دسته سوم گزینه‌هایی که به کنسول‌دارها پیشنهاد می‌شود و در نهایت دسته‌بندی‌ برای حوزه‌‌های تخصصی درنظر گرفتیم.

 """,
        likedArticleUr: "84",
        commentArticleUr: "14",
        writersName: "امید"),
  ];

}
