import 'package:techno_saz/models/data_models.dart';
import 'package:techno_saz/res/paths.dart';
import 'package:techno_saz/res/strings.dart';

class DataClass {
  static Map homePagePosterMap = {
    "imageAsset": Address.banner,
    "titleOnBanner": Strings.titleOnBanner_str,
  };

  static List<HashTagModel> tagList = [
    HashTagModel(title: "جاوا"),
    HashTagModel(title: "کاتلین"),
    HashTagModel(title: "وب"),
    HashTagModel(title: "سلامتی"),
    HashTagModel(title: "پایتون"),
    HashTagModel(title: "دارت"),
    HashTagModel(title: "فلاتر"),
    HashTagModel(title: "تغذیه"),
    HashTagModel(title: "هنر"),
    HashTagModel(title: "ورزش"),
    HashTagModel(title: "بیزنس"),
  ];

  static List<ArticlePageModel> ArticlePageModelList = [
    ArticlePageModel(
        idArticleUr: "1",
        imageArticleUr: Address.articlesImageidOne,
        titleArticleUr: """
رژیم 15 روز تا سلامتی استاد جمشید خدادادی
""",
        writerProfilePhotoUr: Address.writersImageOne,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr: """
باانجام یک رژیم پانزده روزه می توانیداز بیشتر بیماریها نجات پیدا کنید و سلامتی و نشاط خود را بدست آورید و طعم سلامتی جسم و روح را بچشید!اگر رژیم پانزده روزه زیر را دقیقا انجام دهید، با نتایج خیره کننده ای مواجه شد و اثرات فوق العاده مفید آن را به چشم خواهید دید.از این رژیم برای لاغری و تناسب اندام نیز می توان استفاده کرد.با این رژیم، در عرض پانزده روز حدود 4 تا 5 کیلو گرم وزن کم خواهید کرد و پوستی روشن و چهره ای با نشاط پیدا خواهید نمود. و مهمتر از همه، آرامش جالب و خواب عمیق و راحتی پیدا خواهید کرد و از زندگی لذت خواهید برد. حسن این رژیم این است که از غذاهای متنوعی برخوردار است و هر روز غذای مخصوصی میل خواهید کرد؛ زیرا تنوع در غذا باعث می شود که کلیه مواد غذایی لازم به بدن برسد و انسان از فقر غذایی نجات پیدا کند و از مغزی فعال و روانی سالم و جسمی سبک برخوردار شود. امید است با رعایت موارد ذیل سلامتی و نشاط را برای خود به ارمغان بیاورید. افرادی که دچار یبوست مزاج هستند نیز می توانند توصیه های زیر را دقیقا انجام دهند تا از این معضل که خود ام الامراض است نجات پیدا کنند.
 """,
        likedArticleUr: "65",
        commentArticleUr: "5",
        writersName: "هری پاتر"),
    ArticlePageModel(
        idArticleUr: "2",
        imageArticleUr: Address.articlesImageidTwo,
        titleArticleUr: """
عسل دارویی چیست و چه تفاوتی با عسل معمولی دارد؟
""",
        writerProfilePhotoUr: Address.writersImageTwo,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "10" + Strings.minutes,
        ContentArticleUr: """
عسل دارویی یا عسل طبی اهمیت زیادی برای بدن انسان دارد. این نوع عسل به عنوان یک ملین خفیف، سوء هاضمه و عفونت های روده ای، درمان بسیاری از ناراحتی های معده از جمله یبوست محسوب می شود. عسل دارویی دارایی ویژگی هایی است که آن را از عسل معمولی متمایز می کند.

در واقع عسل یک ماده غذایی طبیعی با طعم شیرین با بافت چسبناک است. زنبورها این عسل را از شهد گلها که ترشحات شیرین گیاهی است تولید می کنند.

این کار از طریق فرآیندهای مرتب انجام می شود و شکل نهایی پس از تبخیر آب به وجود می آید و عسل در ساختارهایی که به ساختارهای مومی معروف هستند ذخیره می شود و به این ساختارها لانه زنبوری می گویند.

همچنین زنبورها یک نوع عسل تولید نمی‌کنند، بلکه انواع زیادی را تولید می‌کنند که از نظر رنگ، طعم و بو متفاوت است، همه بر اساس منبع غذای زنبور عسل.

به دلیل افزایش تقاضا برای عسل به دلیل خواص و فواید فراوان، مقادیر زیادی زنبور عسل در سراسر جهان پرورش می‌یابد. در این مقاله به خواص عسل دارویی می پردازیم.

تفاوت عسل دارویی با عسل معمولی چیست؟
خواص درمانی عسل تا حدود زیادی به منبع گلی بستگی دارد که زنبورها شهد و گرده را از آن برداشت می کنند. یکی از دلایلی که عسل دارویی را از دیگر عسل ها متمایز می کند منشا گل آن است.

عسل دارویی به طور طبیعی کدرتر از عسل معمولی است؛ زیرا بقایای لانه زنبوری آنقدر کوچک است که فیلتر نمی شود.

همچنین این عسل نسبت به عسل معمولی از نظر رنگ و بافت تنوع بیشتری دارد. رنگ عسل طبی ممکن است بسته به گل هایی که زنبورها گرده افشانی کرده اند، تغییر کند. برخی مطالعات نشان می دهد که عسل دارویی ممکن است فواید سلامتی بیشتری نسبت به عسل معمولی داشته باشد.

انواع عسل دارویی
عسل با توجه به منابع شهد گلی که زنبورها از آن تغذیه می کنند متفاوت است و بر این اساس انواع عسل به شرح زیر طبقه بندی می شوند:

عسل تک گل
عسل تک گل انواع زیادی دارد و این انواع از نظر رنگ و طعم با هم تفاوت دارند، زنبورداران برای تولید عسل تک رنگ، کندوها را در مکانی نگهداری می کنند که زنبورها فقط برای یک نوع گل از آن عبور کنند.

عسل چند گل
عسل چند گل یا عسل گل وحشی از انواع مختلف گل ها استخراج می شود.

عسل مخلوط
این عسل از اختلاط انواع عسل تهیه می‌شود و انواع عسل‌هایی که مخلوط شده‌اند از نظر رنگ، طعم، تراکم، منشاء جغرافیایی و منبع گل متفاوت هستند.
 """,
        likedArticleUr: "84",
        commentArticleUr: "78",
        writersName: "اَ.ویلسون"),
    ArticlePageModel(
        idArticleUr: "3",
        imageArticleUr: Address.articlesImageidThree,
        titleArticleUr: """
کنترل همروندی چیست؟ 
""",
        writerProfilePhotoUr: Address.writersImageThree,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "14" + Strings.minutes,
        ContentArticleUr: """
در فناوری اطلاعات و علوم رایانه‌ای، به‌خصوص در شاخه‌های برنامه‌نویسی رایانه‌ای، سیستم عامل، چندپردازشی، و پایگاه‌داده‌ها، کنترل همروندی (به انگلیسی: Concurrency Control)، از نتایج تولید شده ناشی از عملیات هم‌زمان اطمینان حاصل کرده، درحالی که سعی می کند در سریع ترین زمان ممکن به نتایج برسد.
سیستم‌های رایانه‌ای، چه نرم‌افزاری و چه سخت‌افزاری، شامل ماژول‌ها یا مؤلفه‌هایی اند. هر مؤلفه به گونه‌ای طراحی شده که به طرز صحیحی عمل کند، یعنی، از قوانین سازگاری بخصوصی تبعیت نموده، یا با آن ها تطابق داشته باشند. هنگامی که مؤلفه‌های هم‌روند با یکدیگر به وسیله پیام‌دهی یا اشتراک‌گذاری داده‌های دسترسی شده برهمکنش کنند (در حافظه یا محل ذخیره‌سازی)، هم‌روندی برخی از مؤلفه‌ها ممکن است توسط مؤلفه‌های دیگری مورد تجاوز و تخطی قرار گیرد. به طور کلی، مبحث هم‌روندی به ارائه قواعد، روش‌ها، روش‌شناسی‌های طراحی و نظریاتی می پردازد که به حفظ سازگاری مؤلفه‌های هم‌روندی، طی اجرای عملیاتشان کمک کند؛ بدین طریق سازگاری و صحت کل سیستم حفظ خواهد شد. معرفی کنترل هم‌روندی به یک سامانه، به معنای اعمال محدودیت‌های عملیاتیست که اغلب منجر به کاهش یافتن برخی از کارایی‌های سامانه می گردد. دستیابی به سازگاری عملیاتی و صحت باید تا حد امکان همراه با بهره‌وری باشد، به گونه‌ای که کارایی از حد معقول خاصی کمتر نشود. ممکن است کنترل همروندی در مقایسه با الگوریتم‌های سری (Sequential Algorithms) (که ساده‌ترند) نیازمند افزودن به پیچیدگی و سربار در قالب یک الگوریتم همروندی باشد.
به عنوان مثال، شکست در کنترل هم‌روندی، ممکن است منجر به خراب‌شدن داده‌ها شود، که ناشی از گسست عملیات خواندن یا نوشتن است.
 """,
        likedArticleUr: "96",
        commentArticleUr: "23",
        writersName: "شایرا"),
    ArticlePageModel(
        idArticleUr: "4",
        imageArticleUr: Address.articlesImageidFour,
        titleArticleUr: """
هوش احساسی چیست؟
""",
        writerProfilePhotoUr: Address.writersImageFour,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "13" + Strings.minutes,
        ContentArticleUr: """
در ابتدا بهتر است یک تعریف کلی از هوش هیجانی ارائه کنیم. هوش احساسی یا هوش هیجانی به انگلیسی Emotional Intelligence، به توانایی شناسایی و مدیریت احساسات خود و احساسات دیگران اشاره دارد. در واقع هوش هیجانی به معنای توانایی مهار احساسات و به کار بردن آنها در کارهایی مانند تفکر و حل مسئله است.

امروزه از هوش هیجانی به عنوان یکی از مؤلفه‌های ذاتی موفقیت در افراد یاد می‌شود. پیش‌بینی و درک رفتار دیگران به ما کمک می‌کند تا در مواقع ضروری بهترین تصمیم را بگیریم. بنابراین مهم است که بدانیم هوش عاطفی چیست و چه مؤلفه‌هایی را در برمی‌گیرد؟

توانایی درک احساسات دیگران و مدیریت احساسات خود می‌تواند منجر به کاهش استرس، برقراری ارتباط موثر، همدلی با دیگران، غلبه بر چالش‌ها و خنثی کردن تعار‌ض‌ها شود. هوش عاطفی یا ای کیو به شما کمک می‌کند تا روابط قوی‌تری ایجاد کنید، در مدرسه و محل کار موفق شوید و به اهداف شغلی و شخصی خود برسید. همچنین به شما کمک می‌کند تا با احساسات خود ارتباط برقرار کنید و تصمیمات آگاهانه‌ای در مورد آنچه برای شما مهم است بگیرید.  

ریشه های تئوری هوش هیجانی (هوش هیجانی در روانشناسی)
اگر بخواهیم تاریخچه هوش هیجانی را به زبان ساده بازبینی کنیم، تئوری هوش هیجانی توسط پیتر سالووی و جان دی مایر در دهه ۱۹۹۰ معرفی شد و به وسیله دانیل گولمن بیشتر توسعه یافت و به عموم مردم ارائه شد. به گفته گلمن، هوش عاطفی بزرگ‌ترین پیش‌بینی‌ کننده موفقیت در محیط کار است. این مفهوم که به عنوان ضریب احساسی یا EQ نیز شناخته می‌شود، در سال‌های اخیر بیشتر مورد توجه قرار گرفته و مقبولیت گسترده‌ای در بین روانشناسان پیدا کرده است.

با این حال، برخی از روانشناسان معتقدند از آنجایی که EQ را نمی‌توان از طریق آزمون‌های روان سنجی مثل انواع تست هوش عمومی مورد ارزیابی قرار داد، این مفهوم فاقد قدرت توضیحی واقعی است. اما برادبری و گریوز توانستند با طرح پرسشنامه‌ای، این مشکل را حل کنند و توانایی ارزیابی آن را نیز به دست آورند. ادوارد تورندایک از روانشناسانی است که در حوزه هوش احساسی تحقیقاتی انجام داد و به نتایجی در مورد اثبات وجود آن دست یافت.

دکتر بار-ان از دیگر افرادی بود که حدود ۲۰ سال از وقت خود را صرف معرفی شیوه‌ای برای اندازه‌گیری EI کرد. بار-ان در طول این مدت مطالعاتی را بر روی بیش از ۱۱۰۰۰۰ نفر در سراسر جهان انجام داد. تست ای کیو بار-ان (آزمون هوش هیجانی بار آن) رفتار هوش هیجانی و اجتماعی را اندازه‌گیری می‌کند. این تست ۱۳۳ آیتم را بر اساس پنج شاخص مورد بررسی قرار می‌دهد.
 """,
        likedArticleUr: "84",
        commentArticleUr: "14",
        writersName: "وانتونز"),
  ];

  static List<ArticlePageModel> MyArticlePageModelList = [
    ArticlePageModel(
        idArticleUr: "1",
        imageArticleUr: Address.myArticlesImageIdOne,
        titleArticleUr:
            "آی‌مک پرو 32 اینچی احتمالاً تا سال 2025 معرفی نخواهد شد ",
        writerProfilePhotoUr: Address.writersImageOne,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr: """
آی‌مک پرو قبلی اپل در سال 2017 معرفی شد و پردازنده اینتل زئون داشت. با توجه به اینکه تمامی خانواده‌ مک‌‌، ازجمله مک پرو به چیپست‌های سری M تجهیز شدند؛ احتمالاً کامپیوتر «All in One» اپل نیز به این پردازنده مجهز شود. به نظر می‌رسد که اپل همچنان درحال کار روی این مدل است و انتظار نمی‌رود تا سال 2025 از آن رونمایی کند. همچنین احتمال دارد اپل آی‌مک پرو جدید را با پنل مینی ال‌ای‌دی ارائه دهد.
به گفته مینگ-چی کو، تحلیلگر اپل، آی‌مک پرو قبلی که نمایشگر 27 اینچی رتینا داشت، طبق شایعه‌ای به یک پنل مینی ال‌ای‌دی 32 اینچی ارتقا پیدا می‌کند. کو پیش‌بینی کرده بود که آی‌مک پرو همراه با دیگر آی‌مک‌ها معرفی و عرضه شود، اما به نظر می‌رسد معرفی آی‌مک پرو تا سال 2025 رخ نخواهد داد.

همچنین طبق گفته مارک گرمن، خبرنگار بلومبرگ، اپل مدتی است مشغول ساخت آی‌مک 24 اینچی با تراشه M3 است. اما او احتمال می‌دهد که ساخت آی‌مک پرو 32 اینچی زود باشد.
 """,
        likedArticleUr: "65",
        commentArticleUr: "5",
        writersName: "جک بندر"),
    ArticlePageModel(
        idArticleUr: "2",
        imageArticleUr: Address.myArticlesImageIdTwo,
        titleArticleUr: """
تصویر روز ناسا: غبار و سحابی پرده غربی""",
        writerProfilePhotoUr: Address.writersImageTwo,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "10" + Strings.minutes,
        ContentArticleUr: """
سحابی پرده حدود 15,000 سال پیش با انفجار ستاره‌ای در صورت فلکی قو یا دجاجه (Cygnus) ایجاد شد. این انفجار پرشکوه به مدت یک هفته حتی درخشان‌تر از ناهید به‌نظر می‌رسید، اما هیچ گزارشی از آن وجود ندارد. این تصویر، ضلع غربی ابر گازی درحال انبساط را نشان می‌دهد. رشته‌های گازی چشمگیر ازجمله سحابی جاروی جادوگر در بالا سمت چپ نزدیک ستاره درخشان پیش‌زمینه 52 ماکیان (52 Cygni) مشاهده می‌شود و Fleming's Triangular Wisp (که قبلاً با نام مثلث پیکرینگ (Pickering's Triangle) شناخته می‌شد) به‌صورت مورب در وسط تصویر قرار دارد.
      غبار قهوه‌ای بازتابنده‌ که به‌صورت عمودی در سمت چپ تصویر مشاهده می‌شود، احتمالاً در جو خنک ستارگان پرجرم ایجاد شده است. این غبار به‌ندرت در تصاویر ثبت می‌شود، اما در نوردهی طولانی این تصویر در میان نوارهای رنگی متعدد می‌توان آن را دید.
 """,
        likedArticleUr: "84",
        commentArticleUr: "78",
        writersName: "آ.آدام"),
    ArticlePageModel(
        idArticleUr: "3",
        imageArticleUr: Address.myArticlesImageIdThree,
        titleArticleUr: """
معرفی برنامه Photo Lab
""",
        writerProfilePhotoUr: Address.writersImageThree,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "14" + Strings.minutes,
        ContentArticleUr: """
ظهور هوش مصنوعی باعث شده است که مدل‌ها و ابزارهای متفاوتی ساخته شوند که هرکدام قابلیت‌های منحصر‌به‌فرد خود را دارند. در این مطلب از دیجیاتو به سراغ برنامه Photo Lab Picture Editor & Art می‌رویم که با کمک هوش مصنوعی می‌تواند تصاویر جذابی براساس چهره شما بسازد.
برنامه اندروید Photo Lab Picture Editor & Art توسط Linerock Investments LTD در گوگل پلی منتشر شده و تاکنون هیچ نسخه‌ای از آن برای سیستم‌عامل iOS منتشر نشده است. این برنامه به‌صورت کاملاً رایگان قابل دانلود و استفاده است؛ هرچند در طول کارکردن با آن تبلیغات نسبتاً زیادی نمایش داده می‌شود.
با کمک این برنامه می‌توانید عکس‌های خودتان را با طیف گسترده و متنوعی از فیلترهای تصویر ویرایش کنید تا به‌عنوان یک خروجی، تصویری از خود در قالب یک کاریکاتور با موضوعات مختلفی داشته باشید.

ازجمله قابلیت‌های این ویرایشگر عکس هوش مصنوعی می‌توان به امکان اضافه‌کردن متن روی عکس‌ها، وجود بیش از 500 افکت متنوع، امکان ساخت عکس‌های کلاژ، امکان طراحی کارت پستال و درنهایت به‌اشتراک‌گذاری عکس‌ها در شبکه‌های اجتماعی اشاره کرد. البته باید اشاره کرد که خروجی نهایی همراه با یک واترمارک ارائه می‌شود که برای حذف آن باید اشتراک برنامه را خریداری کرده یا از نسخه‌های ماد‌شده موجود در اینترنت استفاده کنید.
 """,
        likedArticleUr: "96",
        commentArticleUr: "23",
        writersName: "دنیا"),
    ArticlePageModel(
        idArticleUr: "4",
        imageArticleUr: Address.myArticlesImageIdFour,
        titleArticleUr: """
۱۵ بازی شبیه‌ساز اتومبیل‌رانی برتر""",
        writerProfilePhotoUr: Address.writersImageFour,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "13" + Strings.minutes,
        ContentArticleUr: """
خودروبازها همیشه دستشان برای انتخاب شبیه‌ساز چندان بسته نبوده و بسیاری از استودیوها و ناشران حداقل یک ویدیوگیم خودرو محور در کارنامه خود به ثبت رسانده یا قصد دارند در اختیار مخاطب بگذارند. باتوجه به تفاوت سلایق، سعی کردیم دسته‌بندی براساس کاربرد شبیه‌سازهای خودرومحور را درنظر بگیریم و پیشنهادهای باکیفیت را ضمن ذکر نکات مثبت و منفی هر یک معرفی کنیم. به طور کلی چهار دسته‌بندی در این مقاله پیش‌روی شماست؛ دسته اول شامل نمونه‌هایی که برای تجربه آنلاین بهترین گزینه به حساب می‌آیند، دسته دوم شبیه‌سازهایی که برای انجمن‌ها و کامیونیتی‌ها بهترین فضا را ایجاد کردند، دسته سوم گزینه‌هایی که به کنسول‌دارها پیشنهاد می‌شود و در نهایت دسته‌بندی‌ برای حوزه‌‌های تخصصی درنظر گرفتیم.

 """,
        likedArticleUr: "84",
        commentArticleUr: "14",
        writersName: "امید"),
  ];

  static List<ArticleBookmarkedPage> BookMarkedArticlePageModelList = [
    ArticleBookmarkedPage(
        idArticleUr: "1",
        imageArticleUr: Address.artc_img_Bokmrk_one,
        titleArticleUr: "نقش هوش مصنوعی و اهمیت آن در سیستم های حسابداری",
        writerProfilePhotoUr: Address.writersImageOne,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr: """هوش مصنوعی و آینده حسابداری
همانطور که گفته شد، هوش مصنوعی در تمامی فعالیت‌‌ها، از جمله در فعالیت ‌هایی که نیاز به دقت و سرعت زیاد جهت انجام امور دارند، کاربرد بسیار زیاد دارد. حسابداری و امور مالی یکی از این نوع فعالیت‌ها می‌باشد که انجام امور مالی باید با دقت و سرعت فراوانی انجام گیرد. لذا هوش‌مصنوعی در حسابداری کاربرد زیادی دارد و با به کار بردن هوش‌مصنوعی، آینده حسابداری پیشرفت فراوانی خواهد داشت.

آینده حسابداری با هوش مصنوعی
با به کارگیری هوش‌مصنوعی در حسابداری، تمامی کارها با دقت و سرعت بسیار بالایی انجام می گیرد. در نتیجه آینده حسابداری با هوش مصنوعی دچار تغییر و تحول بسیاری خواهد شد.

با استفاده از هوش‌مصنوعی، حسابداران مجبور نخواهند بود که کارهای سخت و محاسباتی را به صورت دستی انجام دهند، بلکه همه این کارها و تجزیه و تحلیل‌ها بااستفاده از هوش مصنوعی انجام خواهد گرفت که این امر باعث افزایش بهره‌‌وری و کاهش هزینه‌ها خواهد شد.

همچنین حسابداران وقت آزاد بیشتری خواهند داشت و می توانند تمرکز و تلاش بیشتری را در کارهای مهم که باعث رشد و موفقیت شرکت می‌شود، داشته باشند.

5 سوال رایج در حوزه هوش مصنوعی حسابداری
تا اینجا با مفهوم هوش مصنوعی و کاربرد آن در حسابداری و امور مالی آشنا شدید. با توجه به اهمیت هوش‌مصنوعی در حسابداری و همچنین به دلیل سوالات زیاد ایجاد شده در این زمینه، در این بخش از مقاله قصد داریم به چند سوال رایج در حوزه هوش‌مصنوعی و حسابداری پاسخ دهیم.

1- نقش هوش‌ مصنوعی در حسابداری شرکت‌ها چیست؟
یکی از سوالات مهم و پرتکرار این است که نقش هوش‌مصنوعی در حسابداری چیست؟ هوش‌مصنوعی در حسابداری کاربرد زیادی دارد. مهمترین نقش هوش مصنوعی‌در حسابداری شرکت‌ها، انجام کارها با سرعت و در عین حال با دقت فراوان می باشد. در نتیجه باعث کاهش خطاها و افزایش بهره ‌وری و به طور کلی باعث کاهش هزینه‌‌ها و افزایش درآمد در شرکت‌‌ها می‌شود.""",
        likedArticleUr: "250",
        commentArticleUr: "8",
        writersName: "سنا عزیزی"),
    ArticleBookmarkedPage(
        idArticleUr: "2",
        imageArticleUr: Address.artc_img_Bokmrk_tow,
        titleArticleUr: "رقص باله",
        writerProfilePhotoUr: Address.writersImageTwo,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "15" + Strings.minutes,
        ContentArticleUr:
            """باله تجلی افسانه ای حرکت و هنر در دنیای رقص است که مدت هاست مهم و محترم شمرده شده و هنوز هم رویاپردازان بی شماری را به فضای فوق العاده رقابتی اش دعوت می کند. مزایای کلاس های باله کودکان به بچه ها و دانش آموزان نوجوان از آن چه فکر می کنید بیشتر است. اگر کودکتان دوست دارد رقص باله یاد بگیرد، مهم است که یک کلاس باله کودکان که به صورت اصولی این رقص را آموزش می دهند پیدا کنید تا آجرهای اولیه آموزش کودکتان درست چیده شوند.
رقص باله چیست؟
باله یکی از قدیمی ترین و هنری ترین اشکال رقص است و تاریخچه غنی ای دارد. این رقص برای نخستین بار در عصر رنسانس ایتالیا طی قرن ۱۵ ظهور کرد و فرانسه و روسیه تکنیک هایش را پرورش دادند. همچنین واژه باله فرانسوی بوده و از واژه ایتالیایی «بالتو» برگرفته شده که به معنای رقصیدن است. باله در قرن ۲۰ام جهانی شد و به فرهنگ های کشورهای سراسر دنیا پا گذاشت.
سبک های گوناگون باله
سبک های قدیمی رقص باله مانند باله فرانسوی، ایتالیایی، و روسی تحت تاثیر جغرافیا بودند. اما تکنیک های جدیدتر مانند باله نئوکلاسیک و معاصر از ترکیب باله کلاسیک و روش های گوناگون رقص به وجود آمده اند. عصر رمانتیک آغازگر اجراهای زیاد سبک باله رمانتیک قرن نوزدهم بود.
رقاصان باله که بالرینا نام داشتند «توتو»های سنتی می پوشیدند و معمولا در نقش فرشتگان سحرآمیز افسون گر قلب مردان ظاهر می شدند.  تکنیک پوینت یا ایستادن روی نوک انگشتان پا، حرکات دقیق بدن، و احساسات زیاد وجه تمایز این سبک است. «لا سیلفید» و «کوپلیا» دو باله رمانتیک معروف هستند.
رقص باله کلاسیک
اصطلاحات و روش های باله کلاسیک سبک های فرانسوی، ایتالیایی، و روسی را جدا کرده است. همچنین فندق شکن و دریاچه قو از معروف ترین باله های چایکوفسکی هستند.
""",
        likedArticleUr: "130",
        commentArticleUr: "78",
        writersName: "علی شجاعی"),
    ArticleBookmarkedPage(
        idArticleUr: "3",
        imageArticleUr: Address.artc_img_Bokmrk_three,
        titleArticleUr: "شناخت انواع قهوه و روش های دم آوری قهوه",
        writerProfilePhotoUr: Address.writersImageThree,
        PublicationDateArticleUr: "9" + "  " + Strings.daysAgo_str,
        readingTime: "20" + Strings.minutes,
        ContentArticleUr:
            """دم آوری قهوه که جز برترین و بهترین نوشیدنی های جهان به حساب می آید و از معدود نوشیدنی هایی می باشد که در سرتاسر جهان شناخته شده است بسیار مهم می باشد. نحوه دم کردن قهوه با ابهامات و سوالات فراوانی همراه است که شاید جالب باشه بدونید که خیلی از باریستاهای کافی شاپ ها نیز آن را به درستی بلد نیستند!
برای دم آوری قهوه وسایل و روش های گوناگونی وجود دارد که می توان آنها را در سه دسته بندی اصلی را تقسیم کرد:    1. روش غوطه وری یا همجواری (Immersion) 2. روش خیساندن یا پور اور (Pour over) 3. تحت فشار یا اکسترکشن (Pressure).
اگر جز افراد مبتدی هستید لطفاً از این واژه ها نترسید چون ما سعی خواهیم کرد که به ساده ترین روش ممکن روش های دم کردن قهوه را برای شما معرفی کنیم، خیالتون راحت!  و اگر مفاهیم اولیه را متوجه نشدید، در انتهای مقاله روش های عملی رو توضیح دادیم برای شما دوست عزیز.
اگر بخواهیم به طور ساده این روش که اصلی ترین روش تهیه دم آوری قهوه است بازگو کنیم باید بگوییم، روش غوطه وری به این معنی است که قهوه آسیاب شده کاملا در آب غرق می شود و سپس این آب در طول زمان، عمل عصاره گیری قهوه را انجام می‌‌دهد.
روش غوطه وری یا همجواری را می‌‌توان یک روش بدون مداخله مستقیم در دم کردن دانست، و کافیست شما فقط آب را اضافه کنید و منتظر بمانید، چقدر؟ 4 الی 5 دقیقه که تقریبا زمان استاندارد برای تهیه قهوه های مختلف به حساب می آید.
رایج ترین  نوع دم کردن قهوه به روش غوطه وری استفاده از فرنچ پرس است. فرنچ پرس برای تهیه قهوه فرانسه استفاده می شود که قبلاً به طور کامل آموزش دادیم برای شما.
قهوه ترک دومین روش رایج دم آوری قهوه با استفاده از روش همجواری می باشد که در بین ما ایرانی ها نیز خیلی محبوبه. بسیاری از روش‌های دم سرد قهوه (کلدبرو)  و قهوه ساز کلور که شامل خیس خوردن طولانی مدت قهوه می باشند نیز جز این روش میباشند.
می توان گفت تقریبا همه روش‌های غوطه وری دم کردن قهوه به فیلتر کردن هم نیاز دارند. دلیل آن هم این است که در این روش ها تفاله هایی باقی می مانند و  هر فیلتری که استفاده شود، وظیفه حذف تفاله‌های قهوه و ریزترین ذرات موجود در نوشیدنی نهایی را بر عهده دارند.
البته برای قهوه ها و روش های مختلف نوع فیلتر استفاده شده متفاوت است برای مثال، فرنچ پرس از فیلتر فلزی استفاده می‌‌کند در حالی که فیلتر کلور کاغذی است و یا قهوه ترک اصلاً فیلتری ندارد.
دقت کنید در دم کردن قهوه به روش همجواری هرچه زمان میگذرد، سرعت عصاره گیری کم می‌‌شود. این اتفاق به این دلیل است که، همانطور که مواد جامد قهوه در آب حل می‌‌شوند نوشیدنی شما بیشتر و بیشتر اشباع می‌‌شود.
پس یادتان باشد قهوه فرانسه، قهوه ترک، قهوه کلد برو و قهوه کلور همگی با استفاده از روش غوطه وری عصاره گیری می شوند و در ادامه مقاله تک تک آنها را یک توضیح مختصر خواهیم داد که چی هستند ولی به طور کلی 37 روش برای درست کردن قهوه وجود دارد.
""",
        likedArticleUr: "456",
        commentArticleUr: "16",
        writersName: "رضا شفیعی"),
    ArticleBookmarkedPage(
        idArticleUr: "4",
        imageArticleUr: Address.artc_img_Bokmrk_four,
        titleArticleUr: "کمبود محبت پدر چه نشانه هایی دارد؟",
        writerProfilePhotoUr: Address.writersImageFour,
        PublicationDateArticleUr: "8" + "  " + Strings.daysAgo_str,
        readingTime: "6" + Strings.minutes,
        ContentArticleUr:
            """دختری که در شرایط خانوادگی ناسالم به دنیا می آید و در همان جا نیز پرورش پیدا می کند قطعا تجربیات متفاوتی را مشاهده می کند. مثلا پدر و مادرش همواره در حال جنگ و دعوا هستند و هیچ مهر و محبتی بین آنها وجود ندارد. چنین دختری هرگز امنیت روانی و عاطفی را تجربه نمی کند و همین موضوع باعث می شود تا تمامی ابعاد زندگی اش تحت تاثیر قرار بگیرد.
به همین دلیل لازم است بدانیم که پدر و مادر تاثیر مستقیمی بر روی سلامت روان فرزندان دارند. از این رو اگر آنها نتوانند نیازهای روانی فرزندانشان را تامین کنند در آینده نتیجه چنین فقدانی را مشاهده می کنند.
دختران و پسرانی که در دوران کودکی از سمت والدین خود هیچ گونه محبتی را دریافت نمی کنند در طول زندگی شان رفتارهای متفاوتی را از خودشان نشان می دهند. به عنوان مثال پسرانی که از سمت والدین مورد بی مهری قرار گرفته اند همواره دارای رفتار پرخاشگرانه ای هستند.
با این که ممکن است از نظر تحصیلات به درجات خوبی دست پیدا کنند اما به دلیل کمبود محبتی که از سمت والدین تجربه کرده اند از نظر سلامت روان دچار مشکل هستند و نمی توانند رابطه خوب و سالمی با دیگران برقرار کنند.
تاثیر کمبود محبت پدر بر روی روابط عاطفی
همانطور که می دانید پدر اولین جنس مخالفی است که با دختر خودش ارتباط برقرار می کند. از این رو مهم ترین نقش را در روابط عاطفی و احساسی دختر خویش بازی می کند.
به یاد داشته باشید تمام دخترانی که از سمت پدرشان مورد بی مهری قرار گرفته اند و پدرشان به آنها محبت نکرده باشد زمانی که به سن بلوغ می رسند نمی توانند رابطه سالم و خوبی با جنس مخالف داشته باشند. برای آموزش بیشتر به کارگاه آموزش فرزندپروری مراجعه فرمایید.
بنابراین باید بدانیم که بد رفتاری پدر با دختر و عیب جویی های مداوم از فرزند موجب می شود تا فرد از نظر عاطفی دچار مشکل شود و نتواند در آینده رفتارهای سالمی را از خودش بروز دهد.
محبت طلبی
کمبود برخی از عناصر مهم زندگی موجب می شود تا انسان ها در طول زندگی برای تامین آنها رفتارهای متفاوتی را از خودشان نشان دهند. از این رو باید بدانیم که اگر دختری از سمت پدرش کمبود محبت را تجربه کرده باشد همواره این احساس کمبود را با خودش همراه دارد و در بزرگسالی تلاش می کند تا از طریق جلب توجه جنس مخالف کاری کند که به او محبت شود.
پدرانی که فقط از دخترانشان عیب جویی می کنند و تمام کارهایی که دختران انجام می دهد را زیر سوال می برند باعث می شوند تا حرمت نفس یا همان عزت نفس دختران به شدت تضعیف شده و در نتیجه در دوران بزرگسالی دچار احساس خود کم بینی و عقده حقارت می شود.
همچنین پدرانی که اصلا محبت کردن را بلد نیستند و رفتاری سرد با دخترشان دارند موجب می شوند تا آنها برای جبران کمبود محبت خود به سراغ دیگران بروند. همواره در این مسیر افرادی در سر راه دختران قرار می گیرند که از او سو استفاده می کنند و در نتیجه به دلیل وجود طرحواره ها و تله های روانی همان الگوهای قدیمی را تکرار می کنند و در نتیجه بسیاری از روابط آنها دچار مشکل و آسیب می شود.
یعنی حتی اگر با فردی سالم نیز وارد رابطه شوند چون آنها مشکل کمبود محبت را با خود به همراه دارند طبق همان دوران عمل می کنند و به دلیل نوع رفتارهای ناسالمی که با فرد مقابل دارند باعث می شوند تا رابطه آنها دچار خدشه و آسیب شود.
عدم توانایی عشق ورزی
افرادی که دچار کمبود محبت پدر هستند هرگز نمی توانند معنای عشق ورزی را به خوبی بفهمند. چرا که از نظر علمی ما می دانیم که دانش و آگاهی باید به انسان داده شود تا بتواند در زمان های دیگر خروجی آن را مشاهده کنیم. محبت کردن نیز موضوعی است که فرد باید آن را تجربه کند و از والدین خودش آن را مشاهده کند.
در این صورت زمانی که خودش در رابطه با دیگران قرار می گیرد نمی توانند عشق ورزی را انجام دهد. این افراد به گونه ای عمل می کنند که وقتی به رفتار آنها توجه می کنید فکر می کنید آنها افرادی خودشیفته و خودخواه هستند. همچنین نوع رفتار آنها به شکلی است که گویی تنها مصلحت خودشان را می خواند و فقط به نیازها و خواسته های خودشان فکر می کنند.
به همین دلیل آنها توان محبت کردن به دیگران را ندارند و همواره از سمت دیگران به عنوان خودخواه و خودشیفته مورد خطاب قرار می گیرند. زمانی که آنها با فردی وارد رابطه می شوند به صورت خودخواهانه عمل می کنند و اگر همسر یا پارتنر آنها به این شرایط اعتراض کند آنها در پاسخ رفتاری پرخاشگرانه را از خودشان نشان می دهند.
مواردی که در قسمت بالا گفته شد در مورد تاثیر کمبود محبت پدر و مادر نسبت به پسران است. یعنی اگر والدین نسبت به فرزند پسر خود رفتاری سرد و بدون صمیمیت داشته باشند او در بزرگسالی به این صورت رفتار می کند. در ادامه با ما همراه باشید تا تاثیر کمبود محبت پدر را بر روی رفتار دختران مورد بررسی قرار دهیم. همچنین پیشنهاد می شود تا مقاله طرحواره تنبیه را مطالعه فرمایید.
حال اگر یک دختر در دوران کودکی از نظر عاطفی و احساسی دچار کمبود محبت باشد زمانی که بزرگ می شود نوعی رنج درونی را احساس می کند و برای جبران تمام کمبودهای گذشته دست به کارهای مختلفی می زند. این دختران به صورت ناخودآگاه برای جبران احساس غم و رنجی که در درون خود دارند اقدامات افراطی را انجام می دهند.
محبت افراطی یک طرفه
دختری که در خانواده ای سرد و بی محبت پرورش پیدا کرده است برای جبران کمبود محبت پدر و مادر خود وارد بازی کردن نقش می شود. یعنی با عروسک هایش بازی می کند و همواره نقش مادری دلسوز را به خود می گیرد که عروسک هایش را دوست دارد و با این رفتارها تلاش می کند تا کمبود محبت پدرش را جبران کند.
در این حالت زمانی که این دختر وارد رابطه عاطفی با یک پسر می شود آنقدر به او محبت و خوبی می کند که گویی مادر آن پسر است. از این رو باید بدانید که چنین دخترانی هنگامی که در دوران کودکی از سمت پدر یا مادرشان محبتی را دریافت نکرده اند دست به اقدامات افراطی می زنند. یعنی هنگامی که به رفتار آنها توجه می کنید متوجه می شوید که محبت زیادی را به دیگران می کنند و تمامی این رفتارها به صورت ناخودآگاه از او بروز می کند.
""",
        likedArticleUr: "213",
        commentArticleUr: "36",
        writersName: "علیرضا محمدی"),
    ArticleBookmarkedPage(
        idArticleUr: "5",
        imageArticleUr: Address.artc_img_Bokmrk_five,
        titleArticleUr: "مطالعه گروهی؛ مزایا و راهکارها",
        writerProfilePhotoUr: Address.writersImageFive,
        PublicationDateArticleUr: "7" + "  " + Strings.daysAgo_str,
        readingTime: "4" + Strings.minutes,
        ContentArticleUr: """مطالعه گروهی چیست و انواع آن کدام است؟
هنگامی‌که تعدادی از افراد در گروه‌های کوچک مطالعه می‌کنند و نظرات خود را در مورد یک موضوع آموزشی به اشتراک می‌گذارند، به آن مطالعه گروهی می‌گویند و گروهی که به این‌ترتیب تشکیل می‌شود، گروه مطالعاتی یا گروه مطالعه نام دارد. این گروه معمولاً از افرادی تشکیل می‌شود که در یک کلاس یا در یک رشته تحصیل می‌کنند. لزومی ندارد که افراد یک گروه مطالعاتی، یکدیگر را بشناسند بلکه برای تشکیل گروه، شرکت‌کنندگان باید یک موضوع یا برنامه درسی مشترک برای مطالعه داشته‌باشند تا بتوانند نظرات خود را با یکدیگر به اشتراک بگذارند.
اعضای گروه به‌طور مرتب با یکدیگر ملاقات و در مورد موضوع مطالعه بحث می‌کنند. گروه ممکن است رسمی یا غیر رسمی باشد. گروه‌های غیررسمی توسط افرادی که یکدیگر را می‌شناسند، برای مطالعه موضوعات دشوار یا آماده‌شدن برای امتحانات تشکیل می‌شوند. در حالی‌که تشکیل گروه‌های رسمی توسط مسئولین یا اعضای هیئت علمی در مدارس و دانشگاه‌ها برای کار روی یک پروژه مشترک صورت می‌گیرد. در این نوع گروه‌ها، شرکت‌کنندگان برای تحقیق درباره یک موضوع و تهیه یک پروژه گروهی که قرار است به مدرسه یا دانشگاه ارائه شود، گرد هم می‌آیند.
مزایای مطالعه گروهی چیست؟
یک گروه‌ مطالعاتی موثر می‌تواند به دانش‌آموزان کمک کند تا مطالب درسی را به شیوه‌ای عمیق‌تر و دقیق‌تر یاد بگیرند. گروه‌هایی که موفق هستند، انرژی مثبت تولید می‌کنند، مشوق مشارکت فعال هستند و نظم و انضباط را القا می‌کنند. این مهارت‌ها برای یادگیری مهم هستند. در ادامه درباره این مزایا توضیح می‌دهیم.
""",
        likedArticleUr: "600",
        commentArticleUr: "30",
        writersName: "محسن نعمتی"),
    ArticleBookmarkedPage(
        idArticleUr: "6",
        imageArticleUr: Address.artc_img_Bokmrk_six,
        titleArticleUr: "روانشناسی آغوش و تاثیرات جالب بغل کردن",
        writerProfilePhotoUr: Address.writersImageSix,
        PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
        readingTime: "8" + Strings.minutes,
        ContentArticleUr:
            """باید اشاره شود که هورمون اکسی توسین در واقع یک انتقال دهنده عصبی است که به صورت تخصصی بر روی مرکز عاطفی مغز فعالیت می کند و به عبارت دیگر این هورمون یک هورمون حیات بخش و ضروری برای انسان است. نکته دیگری که در خصوص این انتقال دهنده وجود دارد این است که ترشح آن باعث ایجاد احساس رضایتمندی بین انسان ها می گردد و به دنبال آن اضطراب به طرز چشمگیری کاهش می یابد.اکسی توسین آنقدر با اهمیت است که وقتی مادر در حال تولد نوزادش است با ترشح این هورمون در بدن مادر، باعث می شود تا تمام آن دردهایی که هیچکس قادر به تحمل آن نیست به طور کامل توسط مادر قابل تحمل شود و وقتی که مادر فرزندش را در آغوش می گیرد نیز این هورمون شروع به ترشح می کند و به دنبال آن مادر با صبر و شکیبایی فراوان تمام دغدغه های خودش را فراموش کرده و صرفا به نوزادش فکر می کند.حتی این هورمون باعث می شود تا والدین در زندگی نسبت به فرزندانشان فداکار شوند و عمرشان را وقف آن ها کنند. اکسی توسین در مردان نیز موثر بوده و باعث می شود تا آن ها خیلی مهربان شوند و با دیگران به طور صمیمی رفتار نمایند. همچنین از دیگر تاثیراتی که برای این هورمون می توانیم بیان کنیم این است که اکسی توسین یک نوروپپتید است و بر تمام روابط عاطفی و پیوندهای اجتماعی انسان ها تاثیر می گذارد و باعث می شود تا انسان ها مهربان باشند و در موقعیت هایی دست به از خودگذشتگی و ایثار بزنند. برای مطالعه بیشتر حتما مقاله نشانه های ازدواج ناموفق را مطالعه نمایید.نکته ای که در خصوص اکسی توسین وجود دارد این است که به محض ترشح این هورمون در بدن ما شاهد کاهش هورمون استرس یا همان کورتیزول هستیم که به دنبال آن تنش های فرد از بین می رود و ضربان قلب انسان متعادل شده و فرد به آرامش می رسد.تحکیم پیوند عاطفی وقتی انسان ها فرد عزیزی را در آغوش می گیرند باعث می شود تا بین آن ها روابط عاطفی قدرتمندی برقرار شود چرا که همواره آغوش افراد نزیک و عزیزان باعث می شود تا ما احساس آرامش و امنیت کنیم. برای مثال وقتی پدری ، فرزندش را در آغوش می گیرد باعث می شود تا احساس امنیت هم در پدر و هم در فرزند ایجاد شود.در این زمینه نیز تحقیقات بسیاری انجام شده است که نشان می دهد زمانی که انسان ها یکدیگر را در آغوش می گیرند باعث می شود تا احساس نزدیک بین آن ها بیشتر شود و با ایجاد تغییرات فیزیولوژیکی در بدن ما شاهد آرامش و صمیمیت هستیم.ترشح هورمون دوپامین علاوه بر ترشح هورمون اکسی توسین، یکی دیگر از هورمون هایی که باعث شادی انسان می شود هورمون دوپامین است که در آغوش گرفتن افراد باعث افزایش آن شده و به دنبال آن خلق و خوی فرد کنترل گشته و حس خوبی در او ایجاد می شود. باید اشاره شود که اگر دوپامین بدن انسان کاهش یابد فرد دچار خستگی، کسلی، بی انگیزگی و در نهایت افسردگی خواهد شد. ولی زمانی که یکدیگر را بغل می کند باعث می شود تا دوپامین در بدن افزایش یافته و نهایت خلق و خوی شما بهتر می شود.""",
        likedArticleUr: "1000",
        commentArticleUr: "600",
        writersName: "دنیا آسایش"),
    ArticleBookmarkedPage(
        idArticleUr: "7",
        imageArticleUr: Address.artc_img_Bokmrk_seven,
        titleArticleUr: "تاثیر ریاضیات بر هوش",
        writerProfilePhotoUr: Address.writersImageSeven,
        PublicationDateArticleUr: "9" + "  " + Strings.daysAgo_str,
        readingTime: "10" + Strings.minutes,
        ContentArticleUr:
            """علوم ریاضی در حالت كلی پایه تمام علوم مهندسی است. ریاضی مادر تمام علوم است و به عنوان علم دقیقه مطرح می شود هر چه علوم دیگر به ریاضی نزدیك باشند مستدل تر و قطعی تر از علومی هستند كه از ریاضی دور می شوند.
گفت وگویی با دكتر علی آبكار استاد ریاضی و عضو هیأت علمی دانشكده علوم دانشگاه تهران در مورد ریاضی و كاربردش در زندگی و لذت حل مسأله :
چرا ریاضی می خوانیم؟ اصلاً ریاضی به چه دردی می خورد؟
علوم ریاضی در حالت كلی پایه تمام علوم مهندسی است. ریاضی مادر تمام علوم است و به عنوان علم دقیقه مطرح می شود هر چه علوم دیگر به ریاضی نزدیك باشند مستدل تر و قطعی تر از علومی هستند كه از ریاضی دور می شوند. ممكن است در علوم اجتماعی نظریه های مختلفی داشته باشیم كه همه نظریه ها بسته به موقعیت های گوناگون درست باشند ولی در ریاضی تنها یك نظریه داریم یا درست یا غلط. اغلب تئوری های ریاضی ریشه فیزیكی دارند و منشأ و پیدایش آنها در مسائل علمی بوده است.
________________________________________
 
یعنی تمام فرمول هایی كه در تمام این سالها كشف شده و شما زمانی خوانده اید و حالا تدریس می كنید در مسائل علمی فیزیك و شیمی و اقتصادی كاربرد دارد؟
خیر، گاه می دانیم كه این فرمول ها چه كاربردی دارد و منتها خودمان دیگر نمی توانیم به كاربردشان بپردازیم و گاهی هم فرمول را می دانیم و آیندگان كاربردش را پیدا می كنند. اما یك مسأله وجود دارد هیچ علمی مستقیماً به شكوفایی و باروری نمی رسد مگر این كه بخش هایی از ریاضی در آن به كار برده شده باشد. پس ریاضیدان غیر از لذتی كه خودش می برد از روی مفاهیم ریاضی باعث رشد جامعه و تكنولوژی می شود.
لذت؟
بله، به یك ریاضیدان در حالت حل مسأله لذتی دست می دهد و او را ارضا می كند در فلسفه به این حالت لذت حل مسأله می گویند كه افراد دیگر این لذت را درك نمی كنند. این حالت در ریاضی مثل گل كردن طبع شعر شاعری است كه یكباره باعث می شود شعر بگوید.
تمام كاربردهایی كه از ریاضی گفتید كاربردهایی بود كه یك ریاضیدان در زندگی حرفه ای از ریاضی می كند. آیا در زندگی اجتماعی هم از ریاضی استفاده می شود؟ ریاضی در زندگی اجتماعی هم كاربرد دارد؟
البته، ما نباید از خودمان تعریف كنیم ولی كسی كه ریاضیات می خواند بهتر فكر می كند و كسی كه بهتر فكر می كند بهتر زندگی می كند.
پس به خاطر این كه بهتر فكر كنیم از اول دبستان تا سال آخر دبستان ریاضی می خوانیم؟
بله، ریاضی كمك می كند كه بهتر فكر كنیم.
 
برای بهتر فكر كردن راههای بهتری هم وجود دارد. چرا شطرنج بازی نمی كنیم كه فكرمان باز شود؟
شطرنج حالت خاص دارد. البته بخشی از ریاضیات هم جنبه شطرنج و بازی دارد كه به صورت فرم تعمیم گسترش پیدا می كند و در علوم دیگر استفاده می شود.
یعنی ریاضی خواندن ما فقط به خاطر این است كه بتوانیم بهتر فكر كنیم. یعنی من اگر انتگرال و مثلثات نمی خواندم نمی توانستم فكر كنم؟
خیر، این طور نیست، ریاضی در زندگی روزمره به بالابردن قوه تفكر كمك می كند. اما كاربرد و استفاده های دیگری هم دارد. فرض كنید بخشی از ریاضیات آمار است. یك متخصص علوم اجتماعی و تربیتی آیا می تواند منهای آمار مطالعات خودش را ادامه دهد. پس این طور نیست كه فرد همان لحظه از چیزی كه می خواند بهره مند شود. من به عنوان ریاضیدان از علوم اجتماعی - ارتباطات و روانشناسی به یك حداقلی نیازمندم كه در زندگی استفاده كنم. شما هم باید حداقلی از ریاضی بدانید ولی كسی نمی گوید: همه باید ریاضیدان شوند.
این حداقل می تواند در حد چهار عمل اصلی باشد؟ این طور نیست؟
حدود را ما تعیین نمی كنیم. اتفاقاً آنها كه حداقل ها را تعیین می كنند ریاضیدان نیستند. كارشناسان روانشناسی و تعلیم و تربیت در وزارت آموزش و پرورش و وزارت علوم این حدود را تعیین می كنند. البته این كه شما می گویید در حد چهارعمل اصلی درست نیست همانطور كه گفتم حتی محققان علوم اجتماعی و علوم تربیتی هم به یادگیری آمار احتیاج دارند و از ریاضی استفاده می كنند. اما نظر ما این است كه كمیت و حجم باید كم شود و بیشتر به كیفیت اهمیت داده شود.
گفتید كسانی كه ریاضی می خوانند بهتر فكر می كنند آیا افراد باهوش ریاضی می خوانند؟
ریاضی با هوش نسبت مستقیم دارد. یعنی اغلب ریاضیدان ها افراد باهوشی هستند شاید هم خود ریاضی در پروسه پرورش هوش تأثیر می گذارد اما این بدان معنی نیست كه افرادی كه تمایلی به یاد گرفتن ریاضی ندارند افراد بی استعداد یا كم هوشی هستند. ریاضی با علاقه هم رابطه مستقیم دارد.
شما در تمام سالهایی كه ریاضی می خواندید به تدریس فكر می كردید؟ یعنی دلتان می خواست ریاضی بخوانید كه آن را به دیگران تدریس كنید؟
شغل آرمانی برای یك دانشجوی ریاضی گرفتن جای اساتید سابقش است و آرمانی تر این كه موفق به كشف فرمول یا حل مسأله ای شود كه اسمش در كتابها ماندگار شود. من به اولین آرزویم رسیده ام و حالا به آرزوی دوم فكر می كنم.
""",
        likedArticleUr: "64",
        commentArticleUr: "62",
        writersName: "نیما خدایی"),
    ArticleBookmarkedPage(
        idArticleUr: "8",
        imageArticleUr: Address.artc_img_Bokmrk_eight,
        titleArticleUr: "سبک فرزند پروری",
        writerProfilePhotoUr: Address.writersImageEight,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "4" + Strings.minutes,
        ContentArticleUr: """سبک فرزندپروری چیست؟
سبک های فرزندپروری یکی از مهمترین مسائلی است که توسط والدین به درستی درک نمی شود. همان طور که می دانیم رشد سالم کودکان بستگی به عوامل متعددی دارد، پژوهش ها نشان می دهد که آنچه که بیش از همه تعیین کننده سلامت روان کودکان خواهد بود، سبک فرزندپروری والدین آنها است. منظور از سبک فرزند پروری دیدگاهی است که والدین نسبت به تربیت و رشد فرزند دارند، و براساس این دیدگاه شیوه خاصی را برای تعامل با فرزند خود در شرایط مختلف و دوره های متفاوت زندگی وی اتخاذ می کنند.
در دکترتو می‌توانید با بهترین روانشناس در شهر خود آشنا شوید، با آنها به صورت تلفنی یا آنلاین مشورت کنید و همچنین برای دریافت نوبت ویزیت حضوری اقدام کنید.
انواع سبک فرزندپروری
یکی از نکات جالب در مورد پدر و مادر بودن این است که تنوع زیادی در نحوه تربیت فرزندان وجود دارد. در عین حال، اشتراکات زیادی از والدی به والدی دیگر وجود دارد. در حقیقت، شباهت به اندازه ایست که محققان سعی کرده اند والدین را در چهار سبک معمول فرزندپروری دسته بندی کنند.
سبک فرزندپروری شما به ترکیبی از استراتژی هایی گفته می شود که برای تربیت فرزندان خود استفاده می کنید. کارهای دایانا بامریند در دهه ۱۹۶۰ یک دسته بندی معمول برای سبک های فرزندپروری ایجاد کرد. چهار سبک فرزندپروری بامریند دارای نام ها و ویژگی های متمایز هستند.
هر کدام از این سبک‌ها در چهار زمینه‌ی نظم، برقراری ارتباط، انتظارات و بیان احساسات و عواطف با هم متفاوت هستند. سبک های فرزندپروری را می توان برحسب دو عامل محبت و کنترل پدر و مادر به چهار دسته تقسیم کرد:
سبک مستبدانه: دارای کنترل بالا و محبت کم
سبک سهل گیرانه: دارای کنترل کم و محبت زیاد
سبک طردکننده: دارای کنترل کم و محبت کم
سبک مقتدرانه: دارای کنترل زیاد و محبت زیاد
سبک فرزندپروری مستبدانه
والدین مستبد غالباً با نظم و انضباط در نظر گرفته می شوند.
آنها در نظم و انضباط سخت گیرند.
مجازات معمول است.
ارتباطات عمدتا یک طرفه است: از والدین به فرزند.
قوانین معمولاً توضیح داده نمی شوند.
والدین با این سبک معمولاً مذاکره نمی کنند.
انتظارات بالا و بدون انعطاف است.
والدین این سبک معمولا مراقبت و حمایت کمتری دارند.
سبک فرزندپروری سهل گیرانه
پدر و مادرهای سهل گیر ، بیشتر به فرزندان خود اجازه می دهند آنچه را که می خواهند انجام دهند. کمتر کنترل می کنند. یا راهنمایی محدودی را ارائه می دهند. آنها بیشتر دوست هستند تا والد. این والدین معمولا خیلی بخشنده‌اند، از هر چیز زود می‌گذرند. این والدین معمولا به دلیل دلسوزی پیامدهای رفتاری را خیلی جدی اجرا نمی‌کنند
سبک نظم و انضباط آنها مخالف روش فرزندپروری سختگیرانه است.
آنها  بدون قانون هستند یا محدودیت های کمی را اعمال می کنند.
بیشتر به کودکان اجازه می دهند خودشان مشکلات را کشف کنند.
ارتباطات باز است.
این والدین به فرزندان اجازه می دهند تا خود تصمیم بگیرند تا اینکه جهت دهند.
انتظارات معمولاً توسط والدین حداقل است یا تعیین نشده است.
این والدین معمولا گرم و مراقبت کننده‌اند.
""",
        likedArticleUr: "32",
        commentArticleUr: "78",
        writersName: "راحله"),
    ArticleBookmarkedPage(
        idArticleUr: "9",
        imageArticleUr: Address.artc_img_Bokmrk_nine,
        titleArticleUr: "اصول شراکت و آنچه که باید بدانید",
        writerProfilePhotoUr: Address.writersImageNine,
        PublicationDateArticleUr: "1" + "  " + Strings.daysAgo_str,
        readingTime: "7" + Strings.minutes,
        ContentArticleUr:
            """اغراق نیست اگر بگوییم انتخاب یک شریک کاری (شراکت در کار) به اندازه‌ی انتخاب همسر مهم است و درست به همان اندازه در زندگی شما تأثیر می‌گذارد. شروع یک کسب و کار جدید و یا حتی توسعه‌ی آن، می‌تواند تأثیرات مثبت و منفی زیادی را در زندگی شما ایجاد کند.
بسیاری از کارآفرینان، زمانی که در مورد گذشته از آن‌ها سوال می‌شود، می‌گویند که اگر به گذشته بازگردم در انتخاب شریک کاری دقت بیشتری به‌خرج می‌دادم.
این موضوع به‌خاطر آن است که شما بعد از شراکت با یک شخص، تلاش، هزینه، وقت و بسیاری منابع دیگر زندگی خود را با آن شخص به اشتراک می‌گذارید. پس قطعاً اگر این شخص، فرد مناسبی نباشد می‌تواند به شما و زندگی‌تان صدمه‌ی بزرگی وارد کند و پول و وقت شما را به باد دهد.
از طرف دیگر، داشتن یک شریک کاری خوب می‌تواند شما را بسیار موفق‌تر از زمانی کند که به‌تنهایی کار می‌کردید. برای مثال فرض کنید شما یک کارگاه تولیدی تأسیس کرده‌اید و قرار است با شریک کاری‌تان تقسیم کار کنید.
اگر شما کارهای اجرایی را برعهده بگیرید و شریک‌تان مدیریت مواد اولیه و صندوق مالی را برعهده بگیرد و بتواند با تلاش خود، هزینه‌های شرکت را بهینه کند و درآمد را افزایش بدهد به‌طور خودکار سرمایه‌ی شما هم افزایش یافته است بدون آن‌که درگیر کارهای مالی و اداری بشوید.
پس اهمیت شراکت در کسب و کار را متوجه شدید اما این شراکت در گاهی اوقات مشکلاتی نیز دارد که در ادامه آن‌ها ‌را بررسی می‌کنیم.
اما سوال بسیاری از افرادی که به مجموعه‌ی ویزلند مراجعه می‌کنند این است که چه کسی و با چه ویژگی را به‌عنوان شریک کاری انتخاب کنیم؟
سوال این دسته از دوستان نیاز به بررسی‌های تخصصی دارد و برای هر کسب و کار، بسته به نوع آن متفاوت است. اما در دانشگاه کسب و کار هارواد تحقیقاتی انجام شده است که استفاده از نتایج آن، می‌تواند در پیدا کردن شریک کاری کمک به‌سزایی داشته باشد.
۱ـ وجود مهارت‌های تکمیلی
مهم‌ترین عامل موفقیت شراکت در کسب و کار، وجود مهارت‌های تکمیلی در تیم و داشتن بوم کسب و کار است. این مهارت به شما کمک می‌کند تا بتوانید نگرانی‌ای از بابت نبود متخصص در تیم‌تان نداشته باشید. بعضی کسب و کارها در شروع سعی می‌کنند این مهارت‌ها و کارهای مورد نیازشان را برون سپاری کنند که متحمل هزینه‌های زیادی در شروع کار می‌شوند و همین هزینه‌های زیاد می‌تواند یک کسب و کار نوپا را با مشکلات زیادی روبرو کند.
همچنین این کار می‌تواند تأثیر بدی روی کارمندان و دیگر اعضای تیم داشته باشد به‌ این خاطر که آن‌ها عادت می‌کنند که مشکلات و مهارت‌های مورد نیاز شرکت را از بیرون رفع کنند. این کار سازمان را با هزینه‌های زیادی روبرو می‌کند.
باید بدانید که بزرگترین ملاک برای کارآفرینانی مانند ایلان ماسک، وجود مهارت‌های تکمیلی در تیم است. شراکت در کار می‌بایست طبق اصول باشد و هر شراکتی خارج از این اصول انجام شود می‌تواند کسب و کار را با شکست مواجه کند.
در واقع داشتن یک تیم با مهارت‌های مکمل کمک می‌کند تا نقش‌های مختلف و تکمیل کننده در تیم‌تان ایجاد شود و مسولیت پذیری افراد بیشتر شود. علت افزایش مسئولیت پذیری پس از شراکت کار و سرمایه این است که شما انتظارات و وظایف مشخصی را از طرف مقابل‌تان دارید و با این کار می‌توانید ارزیابی‌های مناسبی را در موعدهای مقرر انجام دهید.
البته به‌یاد داشته باشید که تعادل در مهارت‌ها بسیار مهم و ضرروی است و اگر این موضوع به‌خوبی رعایت نشود شما را دچار ضررهای فراوانی می‌کند.
""",
        likedArticleUr: "64",
        commentArticleUr: "14",
        writersName: "شقایق جعفری"),
    ArticleBookmarkedPage(
        idArticleUr: "10",
        imageArticleUr: Address.artc_img_Bokmrk_ten,
        titleArticleUr: "رقص تانگو",
        writerProfilePhotoUr: Address.writersImageTen,
        PublicationDateArticleUr: "8" + "  " + Strings.daysAgo_str,
        readingTime: "6" + Strings.minutes,
        ContentArticleUr:
            """رقص تانگو بیش از همه از فرهنگ اسپانیایی و آفریقایی تأثیر گرفته‌است. رقاصان جشن‌های Candomblé تانگوی امروزی را شکل داده‌اند. سرچشمهٔ این نوع رقص محله‌های پایین دست بوئنوس آیرس بوده‌است. موسیقی این نوع رقص نیز از ترکیب سبک‌های مختلف موسیقی اروپایی شکل گرفته‌است.[۱] در اوایل قرن بیست میلادی، رقاصان و نوازندگان این سبک از بوئنوس آیرس به نواحی دیگر اروپا سفر کرده و این نوع رقص را در کشورهای دیگر نیز توسعه دادند. تانگو در پاریس بسیار مورد توجه قرار گرفت، و پس از آن به زودی به لندن، برلین و دیگر کشورها راه یافت. ویسنته روسی، منتقد هنری می‌گوید: رقص تانگو نوعی میلونگا به همراه قطع حرکات است. از سال ۱۸۹۵ بسیاری از حرکات و حتی نوع نگه داشتن پارتنر (یار رقص) تغییر کردند. برای نمونه دست مرد به‌جای کتف زن، بر روی کمر او قرار گرفت.
بین سال‌ها ۱۸۸۰ تا ۱۹۳۰ میلادی تقریباً ۶ میلیون مهاجر وارد آرژانتین شدند. بیشتر این مهاجران برخاسته از جنوب اروپا بودند که با توجه به سیاست مهاجرپذیری آرژانتین و به دنبال زندگی بهتر به این کشور رفتند. پس از اینکه با مقاومت زمین‌داران بزرگ، اصلاحات ارضی با شکست روبرو شد وضعیت اقتصادی در این کشور رو به وخامت گذاشت و فقر و بیکاری گسترش یافت. اقوام مهاجر به آرژانتین سازها و رقص‌های خود را نیز با خود به این کشور بردند. در بنیاد رقصی که بعدها تانگو نامیده شد، عناصر یا اِلمان‌های رقص "مازورکاًی لهستانی‌ها و ساز "آکاردئون بایان" آلمانی‌ها و رقص‌های دیگری چون والس، لندلر دیده می‌شود. از ترکیب بسیاری از عناصر فرهنگی مهاجران در سال‌های پایانی قرن نوزدهم نخست نوعی موسیقی به همراه آواز به نام میلونگا "Milonga" به وجود آمد که با رقص همراه شد. فلوت، ویولن، گیتار که بعدها هم پیانو به آن اضافه شد، عناصر اصلی این موزیک را تشکیل می‌دادند. این موسیقی در محلات کارگری، فقیر و کافه‌هایی "بدنام" که زنان روسپی رفت‌وآمد داشتند، نواخته می‌شد. در سال ۱۹۰۰ میلادی پاپ پیوس دهم رقص تانگو را جزو گناهان اعلام کرد و این نوع رقص برای افراد مؤمن ممنوع اعلام شد. این درحالی بود که تانگو در آن زمان به یک رقص مردمی تبدیل شده بود. کازیمیرو آیین، از رقصندگان مشهور آن زمان به رم سفر کرد و با اجرای یک رقص به همراه منشی سفارت آرژانتین در مقابل پاپ موفق شد نظر او را تغییر دهد. پس از آن پاپ تصمیم خود را پس گرفت. تا ده‌ها سال رقص تانگو در میان اشراف حاکم بر آرژانتین رقص افراد فقیر و بی سروپا محسوب می‌شد. قبل از آغاز جنگ جهانی اول، تانگو به اروپا راه یافت و نخست پاریس را تصرف کرد. در آن دوران آنچه در پاریس پذیرفته می‌شد، "شیک" به حساب می‌آمد و رقصیدن تانگو در پاریس باعث شد نظر اشراف آرژانتین به این رقص تغییر کند. تانگو در پاریس محدود نماند و تب آن دیگر کلان شهرهای اروپا را نیز فرا گرفت. معلمان رقص انگلیسی با ایجاد تغییراتی در حرکات تانگو نوعی از "تانگوی اروپایی" به وجود آوردند که هنوز هم جزو رقص‌های استاندارد محسوب می‌شود. فرم‌های دیگری هم از تانگو همچون "تانگوی موریس" و "تاانگوی استانلی" در نیویورک به‌وجود آمد که نتوانستند دوام زیادی داشته باشند. تانگو در سال ۱۹۱۵ به فنلاند رسید و از محبوبیت بسیاری برخوردار شد تا حدی که نوع بومی شده آن به "تانگوی فنلاندی" معروف است. در فنلاند فستیوال‌های تانگوی بسیاری برگزار می‌شود. تانگو در سال ۱۹۱۱ به دربار نیکلای دوم در روسیه راه یافت. در ژاپن نیز با کمک بارون تسونامی مگاتا بود که پس از چند سال سکونت در پاریس به خاطر عمل جراحی بینی، رقص تانگو به این کشور راه یافت. رقص تانگو در سال‌های ۱۹۳۵ تا ۱۹۵۵ در آرژانتین دوران طلایی خود را گذراند. بسیاری از مردم دارای رادیو شدند و می‌توانستند با این موزیک برقصند. از سوی دیگر در حالی که اروپا درگیر جنگ بود، وضعیت اقتصادی آرژانتین با تأمین مواد غذایی و به خصوص گوشت کشورهای درگیر جنگ، بهبود یافت و مردم از توان مالی رفتن به کافه‌ها و رستوران‌ها و شرکت در خوشگذرانی و رقص تانگو برخوردار بودند. همزمان با سرنگونی دولت خوان پرون توسط نظامیان و قطع کمک‌های فرهنگی که به حفظ تانگو کمک می‌کردند، از اواخر دهه ۱۹۵۰ جوانان به موزیک راک و رقص راک‌اندرول روی آوردند و تانگو در دهه ۶۰ میلادی حتی در خود آرژانتین تقریباً به فراموشی سپرده شد. با تلاش‌های آستور پیازولا در دهه ۱۹۷۰ میلادی جان تازه‌ای به تانگو دمیده شد. این نوازنده و آهنگساز بزرگ با تانگو نووو "Tango Nuevo" در سراسر جهان به عنوان نماینده موسیقی ریو دلا پلاتا "Rio de la Plata" شناخته می‌شود. با آغاز کودتاهای نظامی در آمریکای لاتین، ۱۹۷۳ در اروگوئه و شیلی و ۱۹۷۶ در آرژانتین هزاران روشنفکر به اروپا گریختند که در میان آن‌ها آستور پیازولا نیز دیده می‌شد. آن‌ها توانستند با "حس تانگو" رنج و اندوه خود را بیان کنند و به گوش جهانیان برسانند. تانگوی آرژانتینی برخلاف دیگر رقص‌ها حرکات ثابت ندارد و نوعی رقص "بداهه" (Improvisation) است که از گام‌های گوناگون تشکیل شده‌است. با این حال تعداد زیادی اِلمان ثابت وجود دارد که رقصندگان می‌توانند از آن‌ها استفاده کنند. در مجموع یازده نوع تانگو وجود دارد. از دهه ۱۹۸۰ میلادی به این سو بار دیگر بر محبوبیت تانگو افزوده شده‌است و هر سال در فستیوال‌های گوناگون هزاران نفر در کنار هم به رقص تانگو می‌پردازند.[۲]
""",
        likedArticleUr: "",
        commentArticleUr: "",
        writersName: "علیرضا محمدی"),
  ];
  static List<NotificationsPagePublic> NotificationsPagePublicModelList = [
    NotificationsPagePublic(
        idArticleUr: "1",
        imageArticleUr: Address.artc_img_Bokmrk_one,
        writerProfilePhotoUr: Address.writersImageOne,
        aFewDaysOrHoursAgo: "2" + " " + Strings.daysAgo_str,
        writersName: "فاطی",
        more: Address.more,
        whatTimeOfDay: "3:45" + " " + Strings.am_str,
        noticeTitle: "به مقاله شما نظر داد."),
    NotificationsPagePublic(
        idArticleUr: "2",
        imageArticleUr: Address.artc_img_Bokmrk_tow,
        writerProfilePhotoUr: Address.writersImageTwo,
        aFewDaysOrHoursAgo: "6" + " " + Strings.daysAgo_str,
        writersName: "علی",
        more: Address.more,
        whatTimeOfDay: "4:13" + " " + Strings.pm_str,
        noticeTitle: "مقاله شما را لایک کرد."),
    NotificationsPagePublic(
        idArticleUr: "3",
        imageArticleUr: Address.artc_img_Bokmrk_three,
        writerProfilePhotoUr: Address.writersImageThree,
        aFewDaysOrHoursAgo: "5" + " " + Strings.daysAgo_str,
        writersName: "رضا",
        more: Address.more,
        whatTimeOfDay: "7:18" + " " + Strings.am_str,
        noticeTitle: "مقاله ی جدیدی منتشر کرد."),
    NotificationsPagePublic(
        idArticleUr: "4",
        imageArticleUr: Address.artc_img_Bokmrk_four,
        writerProfilePhotoUr: Address.writersImageFour,
        aFewDaysOrHoursAgo: "10" + " " + Strings.daysAgo_str,
        writersName: "تایلر",
        more: Address.more,
        whatTimeOfDay: "12:49" + " " + Strings.pm_str,
        noticeTitle: "نظر شما را لایک کرد."),
    NotificationsPagePublic(
        idArticleUr: "5",
        imageArticleUr: Address.artc_img_Bokmrk_five,
        writerProfilePhotoUr: Address.writersImageFive,
        aFewDaysOrHoursAgo: "4" + " " + Strings.daysAgo_str,
        writersName: "کتی",
        more: Address.more,
        whatTimeOfDay: "01:11" + " " + Strings.pm_str,
        noticeTitle: "به نظر شما پاسخ داد."),
    NotificationsPagePublic(
        idArticleUr: "5",
        imageArticleUr: Address.artc_img_Bokmrk_six,
        writerProfilePhotoUr: Address.writersImageSix,
        aFewDaysOrHoursAgo: "7" + " " + Strings.daysAgo_str,
        writersName: "کوین",
        more: Address.more,
        whatTimeOfDay: "6:15" + " " + Strings.am_str,
        noticeTitle: "مقاله جدیدی را منتشر کرد."),
    NotificationsPagePublic(
        idArticleUr: "6",
        imageArticleUr: Address.artc_img_Bokmrk_seven,
        writerProfilePhotoUr: Address.writersImageSeven,
        aFewDaysOrHoursAgo: "4" + " " + Strings.daysAgo_str,
        writersName: "ابراهام",
        more: Address.more,
        whatTimeOfDay: "5:37" + " " + Strings.pm_str,
        noticeTitle: "مقاله شما را لایک کرد."),
    NotificationsPagePublic(
        idArticleUr: "7",
        imageArticleUr: Address.artc_img_Bokmrk_eight,
        writerProfilePhotoUr: Address.writersImageEight,
        aFewDaysOrHoursAgo: "3" + " " + Strings.daysAgo_str,
        writersName: "مهدیس",
        more: Address.more,
        whatTimeOfDay: "14:59" + " " + Strings.pm_str,
        noticeTitle: "به مقاله شما نظر داد."),
    NotificationsPagePublic(
        idArticleUr: "8",
        imageArticleUr: Address.artc_img_Bokmrk_nine,
        writerProfilePhotoUr: Address.writersImageNine,
        aFewDaysOrHoursAgo: "6" + " " + Strings.daysAgo_str,
        writersName: "زلیخا",
        more: Address.more,
        whatTimeOfDay: "13:45" + " " + Strings.pm_str,
        noticeTitle: " نظر شما را لایک کرد."),
    NotificationsPagePublic(
        idArticleUr: "9",
        imageArticleUr: Address.artc_img_Bokmrk_ten,
        writerProfilePhotoUr: Address.writersImageTen,
        aFewDaysOrHoursAgo: "2" + " " + Strings.daysAgo_str,
        writersName: "جولیا",
        more: Address.more,
        whatTimeOfDay: "3:16" + " " + Strings.pm_str,
        noticeTitle: "به مقاله شما نظر داد."),
  ];
  static List<NotificationsPageSystem> NotificationsPageSystemModelList = [
    NotificationsPageSystem(
        idArticleUr: "1",
        iconNoticeUr: Address.ic_profile_NotificationPage,
        noticeText: "تنظیمات حساب شما بروزرسانی شد.",
        timeNotice: "جدید"),
    NotificationsPageSystem(
        idArticleUr: "2",
        iconNoticeUr: Address.ic_updating_NotificationPage,
        noticeText: "آپدیت جدید در دسترس است.",
        timeNotice: "جدید"),
    NotificationsPageSystem(
        idArticleUr: "3",
        iconNoticeUr: Address.ic_myFiles_NotificationPage,
        noticeText: "حافظه شما پر است.    ",
        timeNotice: "جدید"),
    NotificationsPageSystem(
        idArticleUr: "4",
        iconNoticeUr: Address.ic_saved_NotificationPage,
        noticeText: "‘غذای فرانسوی’ با موفقیت ذخیره شد.",
        timeNotice: "جدید"),
    NotificationsPageSystem(
        idArticleUr: "5",
        iconNoticeUr: Address.ic_successfully_NotificationPage,
        noticeText: "ایمیلتان با موفقیت تایید شد !",
        timeNotice: "جدید"),
  ];
  static List<ArticleManagementPagePublishedModel>
      ArticleManagementPagepublishedModelList = [
        /*
        
    ArticleManagementPagePublishedModel(
        idArticleUr: "1",
        imageArticleUr: Address.img_Social_damage_in_the_family_Management_page,
        titleArticleUr: "آسیب های اجتماعی در خانواده",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "5" + Strings.minutes,
        ContentArticleUr:
            """خانواده یکی از مهم ترین و اساسی ترین نهادهای اجتماعی هست که نقش بسزایی در شکل گیری شخصیت، رفتار و ارزش های افراد داره. خانواده محلی هست که انسان ها در اون عشق، امنیت، حمایت و آموزش می گیرن و می دن. اما متاسفانه، خانواده ها هم مثل هر نهاد دیگه ای ممکنه با مشکلات و چالش هایی روبرو بشن که می تونن آسیب های اجتماعی رو به وجود بیارن. برخی از این آسیب ها عبارتند از:

طلاق: طلاق یکی از پدیده هایی هست که در سال های اخیر روند افزایشی داشته و تاثیرات منفی زیادی روی خانواده ها و جامعه داره. طلاق می تونه باعث شکستن اتحاد و همبستگی خانواده بشه و روی روابط بین زوج ها، فرزندان، پدر و مادر ها و خویشاوندان تاثیر بذاره. طلاق می تونه منجر به افزایش استرس، اضطراب، افسردگی، تنهایی، خشم، گناه، عدم اعتماد به نفس و کاهش خودکارآمدی بشه. طلاق همچنین می تونه روی سلامت جسمی و روانی، تحصیل، شغل، اقتصاد و امنیت افراد تاثیر منفی داشته باشه.
خشونت خانگی: خشونت خانگی یکی دیگه از آسیب های اجتماعی هست که در خانواده ها رخ می ده و می تونه شامل خشونت جسمی، روانی، جنسی، اقتصادی و اجتماعی باشه. خشونت خانگی می تونه روی هر عضوی از خانواده اعمال بشه، اما معمولا زنان و کودکان بیشتر از دیگران قربانی اون می شن. خشونت خانگی می تونه باعث شکل گیری الگوهای نامناسب و ناسالم رفتاری بشه و روی سلامت جسمی و روانی، اعتماد به نفس، خلاقیت، یادگیری، رشد و توسعه افراد تاثیر منفی داشته باشه.
مصرف مواد مخدر: مصرف مواد مخدر یکی دیگه از آسیب های اجتماعی هست که در خانواده ها می تونه رخ بده و می تونه شامل مصرف الکل، سیگار، ماری جوانا، هروئین، کوکائین، متامفتامین و دیگر مواد مخدر باشه. مصرف مواد مخدر می تونه باعث ایجاد وابستگی، اعتیاد، بیماری ها، اختلالات روانی، جرم و جنایت، از دست دادن شغل، تحصیل، خانواده و دوستان بشه. مصرف مواد مخدر همچنین می تونه روی روابط بین افراد خانواده تاثیر منفی داشته باشه و باعث شکل گیری رفتارهای خشونت آمیز، بی احترامی، بی توجهی، بی مسئولیتی و بی اعتمادی بشه.
به طور خلاصه، آسیب های اجتماعی در خانواده می تونن موجب شکستن پایه های خانواده بشن و روی زندگی افراد و جامعه تاثیرات منفی و وخیمی داشته باشن. بنابراین، لازمه که انسان ها با ایجاد فضایی از عشق، احترام، اعتماد، همدلی، همکاری و همفکری در خانواده ها، از این آسیب ها پیشگیری کنن و اگر با اونها مواجه شدن، با استفاده از راهکارهایی مثل مشاوره، آموزش، حمایت و درمان با اونها مقابله کنن.""",
        likedArticleUr: "400",
        commentArticleUr: "650",
        writersName: "بانوی سبز",
        Visit: "600"),
    ArticleManagementPagePublishedModel(
        idArticleUr: "2",
        imageArticleUr: Address.Img_Birth_history_Managemen_page,
        titleArticleUr: "تاریخچه تولد گرفتن",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "6" + "  " + Strings.daysAgo_str,
        readingTime: "8" + Strings.minutes,
        ContentArticleUr:
            """تولد گرفتن یکی از مراسم های شاد و مهم در زندگی انسان ها هست که در اون روز تولد فرد رو جشن می گیرن و به اون تبریک و هدیه می دن. اما آیا می دونید که این مراسم از کجا شروع شده و چه تاریخچه ای داره؟ در این مقاله قصد داریم به بررسی تاریخچه تولد گرفتن بپردازیم.

به طور کلی، تولد گرفتن به دو معنی می تونه باشه: یکی روزی هست که فرد به دنیا اومده و دیگری روزی هست که فرد به سن قانونی رسیده. در برخی از فرهنگ ها، این دو روز با هم متفاوت هستن و به طور جداگانه جشن می گیرن. برای مثال، در چین، روز تولد فرد بر اساس تقویم قمری محاسبه می شه و در روز اول ماه جدید سال جشن می گیرن. اما روزی که فرد به سن قانونی می رسه، بر اساس تقویم خورشیدی هست و در روز اول سال جدید چینی جشن می گیرن.

اولین نشانه هایی از جشن گیری تولد گرفتن رو می تونیم در تمدن های باستانی مثل مصر، یونان، روم و فارس ببینیم. اما این جشن ها معمولا مختص به پادشاهان، خدایان و افراد مهم بودن و برای مردم عادی برگزار نمی شدن. برای مثال، در مصر باستان، روز تولد فرعون رو به عنوان روزی که اون به خدایی تبدیل شده جشن می گرفتن. در یونان باستان، روز تولد آرتمیس، خدایه ماه و شکار رو با شمع روشن کردن روی کیک جشن می گرفتن. در روم باستان، روز تولد میترا، خدایه نور و حقیقت رو با شمع روشن کردن روی کیک جشن می گرفتن. در فارس باستان، روز تولد شاهان رو با شمع روشن کردن روی کیک جشن می گرفتن.

در قرون وسطی، جشن گیری تولد گرفتن در اروپا کم رنگ شد و بیشتر توسط مسیحیان به عنوان یک عادت وثنی محکوم می شد. اما در دوره رنسانس، جشن گیری تولد گرفتن دوباره شروع شد و برای افراد مشهور و ثروتمند برگزار می شد. در این دوره، کیک تولد، شمع، تبریک و هدیه دادن به عنوان بخش هایی از مراسم تولد گرفتن شناخته می شدن. اما مردم عادی هنوز از این مراسم محروم بودن و فقط روز نامگذاری خودشون رو جشن می گرفتن.

در قرن هجدهم، جشن گیری تولد گرفتن در آلمان به عنوان یک مراسم مخصوص کودکان شکل گرفت و نام کیندرفست یا جشن کودک گرفت. در این مراسم، کودکان روز تولدشون رو با خانواده و دوستانشون جشن می گرفتن و کیک تزئین شده با شمع، تبریک، هدیه، بازی و آهنگ می گرفتن. این مراسم به تدریج در سراسر اروپا و آمریکا پخش شد و برای بزرگسالان هم برگزار شد.

در قرن بیستم، جشن گیری تولد گرفتن به عنوان یک مراسم عمومی و رایج در بسیاری از کشورها و فرهنگ ها شناخته شد و برای همه افراد بدون توجه به جنسیت، سن، نژاد، مذهب و طبقه برگزار شد. در این مراسم، علاوه بر کیک، شمع، تبریک و هدیه، از بالون، کارت تبریک، تاج، کنفتی، آهنگ تولدت مبارک و دیگر لوازم جشن استفاده می شد. همچنین، برخی از مردم برای جشن گیری تولد خودشون یا دیگران، از مکان ها و فعالیت های مختلفی مثل رستوران، پارک، سینما، کنسرت، موزه، سفر و غیره استفاده می کردن.

به طور خلاصه، تاریخچه تولد گرفتن یک تاریخچه طولانی و جذاب هست که نشان می ده که چطور این مراسم از یک مراسم مختص به افراد خاص و مقدس به یک مراسم عمومی و شاد برای همه افراد تبدیل شده. این مراسم یکی از راه هایی هست که می تونه به ما کمک کنه که از زندگی خودمون و دیگران قدردانی کنیم و با عشق و شادی به اونها توجه کنیم.

""",
        likedArticleUr: "800",
        commentArticleUr: "600",
        writersName: "بانوی سبز",
        Visit: "200"),
    ArticleManagementPagePublishedModel(
        idArticleUr: "3",
        imageArticleUr: Address.Img_team_work_Managemen_page,
        titleArticleUr: "تاثیر کار تیمی در پروژه",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
        readingTime: "7" + Strings.minutes,
        ContentArticleUr:
            """کار تیمی یکی از مهارت هایی هست که در دنیای امروز بسیار مورد نیاز و ارزشمند هست. کار تیمی به معنی همکاری و هماهنگی بین افرادی هست که برای رسیدن به یک هدف مشترک تلاش می کنن. کار تیمی در زمینه های مختلفی مثل شغل، تحصیل، ورزش، هنر و غیره کاربرد داره و می تونه تاثیرات مثبت زیادی روی موفقیت پروژه ها و فعالیت ها داشته باشه. برخی از این تاثیرات عبارتند از:

افزایش بهره وری و کیفیت: کار تیمی می تونه باعث افزایش بهره وری و کیفیت کار بشه، چون افراد می تونن از دانش، تجربه، مهارت و نظرات هم استفاده کنن و کار رو به صورت تقسیم وظایف و همکاری انجام بدن. این موضوع می تونه باعث کاهش زمان، هزینه و خطا بشه و به افزایش رضایتمندی مشتری و سود بشه.
افزایش یادگیری و رشد: کار تیمی می تونه باعث افزایش یادگیری و رشد افراد بشه، چون افراد می تونن از یکدیگر چیزهای جدید یاد بگیرن و مهارت ها و دانش خودشون رو به اشتراک بذارن. این موضوع می تونه باعث افزایش اعتماد به نفس، خلاقیت، انگیزه و توانایی حل مسئله بشه و به بهبود عملکرد و کارآیی بشه.
افزایش ارتباط و همبستگی: کار تیمی می تونه باعث افزایش ارتباط و همبستگی بین افراد بشه، چون افراد می تونن با گفتگو، گوش دادن، بیان نظر، پذیرش نقد و تعامل با هم رابطه خوبی برقرار کنن. این موضوع می تونه باعث افزایش احترام، اعتماد، همدلی، همکاری و همفکری بشه و به کاهش تنش، تعارض و اختلاف بشه.
به طور خلاصه، کار تیمی یکی از عوامل موثر در موفقیت پروژه ها و فعالیت ها هست که می تونه تاثیرات مثبت زیادی روی بهره وری، یادگیری، ارتباط و همبستگی افراد داشته باشه. بنابراین، لازمه که انسان ها با یادگیری و اجرای اصول و مهارت های کار تیمی، از این فرصت بهره مند بشن و با همکاری و هماهنگی با دیگران به اهداف خودشون و جامعه برسن.""",
        likedArticleUr: "524",
        commentArticleUr: "746",
        writersName: "بانوی سبز",
        Visit: "321"),
    ArticleManagementPagePublishedModel(
        idArticleUr: "4",
        imageArticleUr: Address.Img_fashion_Managemen_page,
        titleArticleUr: "فشن مد در 2024",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "7" + "  " + Strings.daysAgo_str,
        readingTime: "3" + Strings.minutes,
        ContentArticleUr:
            """فشن مد یکی از زمینه هایی هست که هر سال با تغییرات و روندهای جدیدی روبرو می شه و بر روی سبک و ظاهر افراد تاثیر می ذاره. فشن مد می تونه با توجه به عوامل مختلفی مثل فرهنگ، اقتصاد، سیاست، فناوری، هنر و طبیعت شکل بگیره و به عنوان یک راه بیان خود و ارتباط با دیگران عمل کنه. در این مقاله قصد داریم به بررسی برخی از روندهای فشن مد در سال 2024 بپردازیم.

بر اساس پیش بینی های کارشناسان و مجلات مد، برخی از روندهای فشن مد در سال 2024 عبارتند از:

اکولوژیک و پایدار: یکی از روندهایی که در سال 2024 اهمیت زیادی خواهد داشت، اکولوژیک و پایدار بودن لباس ها و اکسسوری ها هست. این روند به معنی استفاده از مواد طبیعی، بازیافتی و بیومتریک هست که کمترین آسیب رو به محیط زیست و انسان ها وارد می کنن. برای مثال، از پنبه ارگانیک، الیاف گیاهی، چرم مصنوعی، پلاستیک دریایی و قارچ برای ساخت لباس ها و اکسسوری ها استفاده می شه. همچنین، از رنگ های طبیعی و بدون سم برای رنگ آمیزی لباس ها استفاده می شه. این روند باعث می شه که مصرف کنندگان بتونن از خرید لباس ها و اکسسوری هایی که باعث کاهش زباله، آلودگی و گرمایش جهانی نمی شن، لذت ببرن و همچنین به حفظ سلامت خودشون و سیاره کمک کنن.
تکنولوژیک و هوشمند: یکی دیگه از روندهایی که در سال 2024 محبوبیت زیادی خواهد داشت، تکنولوژیک و هوشمند بودن لباس ها و اکسسوری ها هست. این روند به معنی استفاده از فناوری های پیشرفته و نوین مثل نانو، الکترونیک، بلوتوث، وای فای، اینترنت اشیا و هوش مصنوعی هست که به لباس ها و اکسسوری ها قابلیت های جدیدی می دن. برای مثال، از لباس ها و اکسسوری هایی استفاده می شه که می تونن دما، رطوبت، ضربان قلب، فشار خون، سطح اکسیژن و دیگر عوامل سلامت رو اندازه گیری و نمایش بدن و همچنین به دستگاه های دیگه مثل گوشی، ساعت، کامپیوتر و غیره متصل بشن. این روند باعث می شه که مصرف کنندگان بتونن از لباس ها و اکسسوری هایی که باعث افزایش راحتی، امنیت، کارآمدی و تفریح نمی شن، استفاده کنن و همچنین به بهبود سلامت و کیفیت زندگی خودشون کمک کنن.
چند منظوره و تبدیل پذیر: یکی دیگه از روندهایی که در سال 2024 مورد توجه خواهد بود، چند منظوره و تبدیل پذیر بودن لباس ها و اکسسوری ها هست. این روند به معنی استفاده از لباس ها و اکسسوری هایی هست که می تونن بر اساس نیاز، سلیقه و شرایط مختلف تغییر شکل، رنگ، سایز و کارکرد بدن. برای مثال، از لباس ها و اکسسوری هایی استفاده می شه که می تونن با استفاده از زیپ، دکمه، بند، چسب، مغناطیس و غیره به شکل های مختلفی مثل شلوار، دامن، لباس، کت، شال، کلاه و غیره تبدیل بشن. همچنین، از لباس ها و اکسسوری هایی استفاده می شه که می تونن با استفاده از الیاف حساس به حرارت، نور، صدا، لمس و غیره رنگ های مختلفی رو نشان بدن. این روند باعث می شه که مصرف کنندگان بتونن از لباس ها و اکسسوری هایی که باعث افزایش تنوع، انعطاف پذیری، خلاقیت و شخصیت نمی شن، استفاده کنن و همچنین به کاهش مصرف و هزینه کمک کنن.
به طور خلاصه، فشن مد در سال 2024 یک فشن مدرن، نوآورانه و مسئولانه خواهد بود که با توجه به نیازها، سلیقه ها و شرایط مختلف افراد و جامعه شکل می گیره و به عنوان یک راه بیان خود و ارتباط با دیگران عمل می کنه.""",
        likedArticleUr: "417",
        commentArticleUr: "258",
        writersName: "بانوی سبز",
        Visit: "618"),
        */
  ];
  static List<ArticleManagementPagedraftModel>
      ArticleManagementPagedraftModelList = [
        /*
        
    ArticleManagementPagedraftModel(
        idArticleUr: "1",
        imageArticleUr: Address.img_graduation_Managemen_page,
        titleArticleUr: " زندگی دانشجویی در امریکا",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "7" + "  " + Strings.daysAgo_str,
        readingTime: "15",
        ContentArticleUr:
            """امریکا یکی از مقاصد محبوب و مورد تقاضای دانشجویان از سراسر جهان هست که می خوان در دانشگاه های معتبر و با کیفیت اون تحصیل کنن. اما زندگی دانشجویی در امریکا چه ویژگی ها و چالش هایی داره؟ در این مقاله قصد داریم به بررسی برخی از جنبه های زندگی دانشجویی در امریکا بپردازیم.

تحصیل: تحصیل در امریکا می تونه یک فرصت عالی برای یادگیری و رشد باشه، چون دانشگاه های امریکا از بهترین استادان، تجهیزات، منابع و برنامه های آموزشی برخوردار هستن. دانشجویان می تونن از طیف گسترده ای از رشته ها و مقاطع تحصیلی انتخاب کنن و بر اساس علاقه و هدف خودشون برنامه درسی شخصی سازی کنن. دانشجویان همچنین می تونن از امکانات و فعالیت های مختلفی مثل کتابخانه، آزمایشگاه، کارگاه، کنفرانس، سمینار، کلوپ، ورزش، هنر و غیره استفاده کنن و تجربه های جدیدی کسب کنن. اما تحصیل در امریکا هم مستلزم تلاش، انگیزه، مسئولیت و مدیریت زمان هست، چون دانشگاه های امریکا از دانشجویان انتظار دارن که به صورت خودمختار و خلاقانه درس بخونن و پروژه ها و تکالیف رو انجام بدن. دانشجویان باید با استانداردهای آکادمیک و اخلاقی دانشگاه ها مطابقت داشته باشن و از تقلب و کپی برداری پرهیز کنن.
مالی: مالی یکی از چالش های اصلی زندگی دانشجویی در امریکا هست، چون هزینه های تحصیل و زندگی در امریکا بسیار بالا هستن. دانشجویان باید برای پرداخت شهریه، کتاب، لوازم، اسکان، غذا، حمل و نقل، بیمه، تفریح و غیره بودجه بندی کنن و منابع مالی خودشون رو تامین کنن. دانشجویان می تونن از راه های مختلفی مثل بورسیه، قرض الحسنه، کار در دانشگاه یا خارج از دانشگاه، حمایت خانواده و دوستان و غیره برای کمک مالی استفاده کنن. اما این راه ها هم معمولا محدود و شرط دار هستن و نیاز به برنامه ریزی و اقدام دارن.
فرهنگی: فرهنگی یکی از جذاب ترین و همزمان سخت ترین جنبه های زندگی دانشجویی در امریکا هست، چون دانشجویان با یک فرهنگ متفاوت از فرهنگ خودشون روبرو می شن و باید با اون سازگار بشن. دانشجویان می تونن از آشنایی با فرهنگ امریکا و مردم اون لذت ببرن و چیزهای جدیدی یاد بگیرن. دانشجویان همچنین می تونن از تنوع فرهنگی و اجتماعی دانشگاه ها و شهرهای امریکا بهره مند بشن و با افراد از سراسر جهان دوست بشن و از فرهنگ ها و زبان های مختلف آگاه بشن. اما این جنبه هم ممکنه باعث ایجاد چالش هایی مثل برخورد با تفاوت ها، تعارضات، تبعیض، تنهایی، دلتنگی و فرهنگ شوک بشه. دانشجویان باید با احترام، باز بودن، تحمل و یادگیری با این چالش ها مقابله کنن و از منابع و خدماتی مثل مشاوره، حمایت، آموزش و فعالیت های فرهنگی که دانشگاه ها و سازمان های دیگه ارائه می دن استفاده کنن.
به طور خلاصه، زندگی دانشجویی در امریکا یک زندگی پر از فرصت ها و چالش ها هست که می تونه برای دانشجویان تجربه ای بی نظیر و مفید باشه. دانشجویان باید با برنامه ریزی، تلاش، انگیزه و سازگاری از این تجربه به بهترین نحو بهره ببرن و به اهداف خودشون و جامعه کمک کن""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "3:45" + " " + Strings.am_str),
    ArticleManagementPagedraftModel(
        idArticleUr: "2",
        imageArticleUr: Address.img_artificial_intelligence_Managemen_page,
        titleArticleUr: "رابطه هوش مصنوعی با انسان",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "9" + "  " + Strings.daysAgo_str,
        readingTime: "17",
        ContentArticleUr:
            """هوش مصنوعی یا AI یکی از پیشرفته ترین و جذاب ترین شاخه های علم کامپیوتر هست که به مطالعه و ساخت ماشین ها و نرم افزار هایی می پردازه که می تونن به طور خودکار وضعیت ها رو تحلیل کنن، تصمیم بگیرن و یاد بگیرن. هوش مصنوعی در زمینه های مختلفی از جمله بازی های کامپیوتری، پزشکی، رباتیک، امنیت، تجارت و آموزش کاربرد داره و هر روز بیشتر و بیشتر در زندگی روزمره ما نفوذ می کنه.

رابطه هوش مصنوعی با انسان یک موضوع مهم و پیچیده هست که از نظر فلسفی، اخلاقی، اجتماعی و حقوقی می تونه چالش ها و فرصت های زیادی رو به وجود بیاره. برخی از این چالش ها عبارتند از:

تاثیر هوش مصنوعی بر شغل ها و اقتصاد: هوش مصنوعی می تونه با انجام کارهایی که قبلا توسط انسان ها انجام می شدن، باعث افزایش بهره وری و کاهش هزینه ها بشه. اما این موضوع می تونه همچنین منجر به از دست دادن شغل ها و افزایش بیکاری و فقر بشه. بنابراین، لازمه که انسان ها بتونن مهارت ها و دانش های جدیدی رو یاد بگیرن و با تغییرات سازگار بشن.
تاثیر هوش مصنوعی بر اخلاق و ارزش ها: هوش مصنوعی می تونه با ایجاد ماشین ها و نرم افزار هایی که قابلیت انجام کارهایی رو دارن که مربوط به احساسات، خلاقیت، انتخاب و مسئولیت هستن، باعث شکل گیری مفاهیم و استانداردهای اخلاقی جدیدی بشه. اما این موضوع می تونه همچنین منجر به ایجاد تعارضات و مشکلاتی بشه که مربوط به حقوق، کنترل، امنیت و حفظ حریم خصوصی هستن. بنابراین، لازمه که انسان ها بتونن قوانین و معیارهایی رو تعیین کنن که از سوء استفاده و خطرات هوش مصنوعی جلوگیری کنن.
به طور خلاصه، رابطه هوش مصنوعی با انسان یک رابطه پویا و تکاملی هست که می تونه هم مزایا و هم معایبی رو داشته باشه. انسان ها باید با هوش و حکمت از هوش مصنوعی به عنوان یک ابزار و یک همکار استفاده کنن و نه به عنوان یک رقیب و یک تهدید. اینطوری می تونن از فواید هوش مصنوعی برای بهبود زندگی خودشون و جامعه بهره ببرن و از مخاطرات آن جلوگیری کنن.""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "7:48" + " " + Strings.am_str),
    ArticleManagementPagedraftModel(
        idArticleUr: "3",
        imageArticleUr: Address.Img_Santorini_Managemen_page,
        titleArticleUr: "جزیره ی سانتورینی",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
        readingTime: "13",
        ContentArticleUr:
            """جزیره ی سانتورینی یا تیرا یکی از زیباترین و مشهورترین جزایر یونان هست که در دریای اژه واقع شده و بخشی از مجموعه جزایر سیکلاد هست. این جزیره با داشتن مناظر خیره کننده، آب و هوای معتدل، فرهنگ غنی و تاریخ باستانی جذابیت های زیادی برای گردشگران از سراسر جهان داره. در این مقاله قصد داریم به بررسی برخی از جاذبه های جزیره ی سانتورینی بپردازیم.

کالدرا: کالدرا یا لگن آتشفشانی یکی از برجسته ترین ویژگی های جزیره ی سانتورینی هست که به عنوان یکی از بزرگترین و زیباترین کالدراهای جهان شناخته می شه. این کالدرا در اثر فوران های آتشفشانی قدرتمندی که حدود 3600 سال پیش رخ دادن و باعث از بین رفتن تمدن مینوئی شدن، شکل گرفته و اکنون یک حوضچه آب شور با عمق 400 متر هست که از سه طرف توسط جزایر سانتورینی، تراسیا و آسپرونیسی احاطه شده. این کالدرا یک منظره فوق العاده از آب آبی، صخره های قرمز و سفید و خانه های رنگین رو به نمایش می ذاره و یکی از بهترین مکان ها برای تماشای غروب خورشید هست.
فیرا: فیرا یا تیرا شهر اصلی و مرکز اداری و تجاری جزیره ی سانتورینی هست که در ساحل شمال غربی کالدرا قرار داره. این شهر با داشتن خانه ها و کلیساهای سفید رنگ با سقف های آبی، کوچه ها و پله های سنگی، مغازه ها و رستوران های شیک و مدرن، موزه ها و گالری های هنری و مناظر دیدنی از کالدرا و دریا، یکی از محبوب ترین مقاصد گردشگری جزیره هست. این شهر همچنین میزبان برخی از جشن ها و رویدادهای فرهنگی مثل جشن گل ها، جشن موسیقی سانتورینی و جشن فیلم سانتورینی هست.
ایا: ایا یا اویا یکی دیگه از شهرهای زیبا و مشهور جزیره ی سانتورینی هست که در ساحل شمال غربی کالدرا قرار داره. این شهر با داشتن خانه ها و کلیساهای سنتی، قلعه ونتسیایی، فانوس دریایی، حمام های گرم آبی، مزارع انگور و بادام، یکی از زیباترین و آرام ترین شهرهای جزیره هست. این شهر همچنین یکی از بهترین مکان ها برای تماشای غروب خورشید هست که هر روز صدها گردشگر رو به خودش جذب می کنه.
اکروتیری: اکروتیری یا آکروپولیس یکی از مهم ترین و قدیمی ترین محوطه های باستانی جزیره ی سانتورینی هست که در ساحل جنوب غربی جزیره قرار داره. این محوطه باقیمانده یک شهر مینوئی هست که در اثر فوران آتشفشانی که در حدود 1600 سال پیش رخ داد، زیر خاکستر و خاک پنهان شد. این شهر با داشتن خانه ها، معابد، بازارها، کارگاه ها، آب انبارها، نقاشی ها و مجسمه هایی که از زندگی روزمره مردم نشان می دن، یکی از شگفت انگیزترین و مهم ترین کشف های باستان شناسی هست. این شهر همچنین به عنوان یکی از الهام بخش ترین منابع برای افسانه ای شهر غرق شده اطلانتیس شناخته می شه.
به طور خلاصه، جزیره ی سانتورینی یک جزیره ی فوق العاده زیبا و جذاب هست که با داشتن کالدرا، فیرا، ایا، اکروتیری و دیگر جاذبه ها، یکی از بهترین مقاصد گردشگری در یونان و جهان هست. این جزیره یک تجربه ی بی نظیر و خاطره انگیز رو برای کسانی که به دنبال زیبایی، تاریخ، فرهنگ و آرامش هستن، ارائه می ده.""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "06:51" + " " + Strings.am_str),
        */
  ];

  static List<ArticleManagementPageAwaitingConfirmationModel>
      ArticleManagementPageAwaitingConfirmationModelList = [
        /*
    ArticleManagementPageAwaitingConfirmationModel(
        idArticleUr: "1",
        imageArticleUr: Address.Img_Interior_decoration_Managemen_page,
        titleArticleUr: "دکوراسیون داخلی منزل",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "6" + "  " + Strings.daysAgo_str,
        readingTime: "15",
        ContentArticleUr:
            """دکوراسیون داخلی منزل یکی از مهم‌ترین عواملی است که بر روحیه، خلاقیت و آرامش ساکنان آن تأثیر می‌گذارد. دکوراسیون داخلی منزل شامل انتخاب رنگ‌ها، مبلمان، نور، پوشش‌ها، تزئینات و سبک‌های مختلف است که باید با توجه به نیازها، سلیقه‌ها و بودجه‌های مختلف طراحی و اجرا شود. برای داشتن یک دکوراسیون داخلی منزل زیبا و مناسب، باید چند مرحله را طی کرد. اولین مرحله نیازسنجی است که در آن باید عادت‌ها، سبک زندگی و انتظارات اعضای خانواده را شناخت. دومین مرحله انتخاب سبک دکوراسیون است که می‌تواند از سبک‌های مختلف مانند کلاسیک، مدرن، امروزی، سنتی، صنعتی، روستیک و غیره باشد. سومین مرحله تعیین و تقسیم بودجه است که باید بر اساس اولویت‌ها و هزینه‌های مختلف انجام شود. چهارمین مرحله طراحی و اجرای دکوراسیون است که می‌تواند با استفاده از متخصصان یا خود افراد خانواده انجام شود. در این مرحله باید به اصول اساسی دکوراسیون داخلی مانند تناسب، تعادل، تکرار، تنوع، تمرکز و تناغم توجه کرد. همچنین باید به اجزا و عناصر دکوراسیون مانند رنگ، نور، مبلمان، پوشش‌ها و تزئینات دقت کرد.""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "09:45" + " " + Strings.am_str),
    ArticleManagementPageAwaitingConfirmationModel(
        idArticleUr: "2",
        imageArticleUr: Address.Img_tattoo_Managemen_page,
        titleArticleUr: "تتو و انواع آن",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "6",
        ContentArticleUr:
            """تتو یا خالکوبی یک روش هنری است که با وارد کردن رنگدانه‌های خاص به زیر پوست، طرح‌ها و نمادهای مختلفی را روی بدن ایجاد می‌کند. تتو می‌تواند برای اهداف تزئینی، نمادین، شناسایی یا یادبود باشد. تتو دارای قدمت و فرهنگ غنی است و در بسیاری از جوامع و ملل مورد استفاده قرار گرفته است. تتو به دو دسته اصلی تقسیم می‌شود: تتو دائمی و تتو موقت. تتو دائمی با استفاده از سوزن‌های خاص و جوهرهای غیرقابل پاک شدن انجام می‌شود و برای حذف آن نیاز به جراحی یا لیزر دارد. تتو موقت با استفاده از روش‌هایی مانند حنا، خودکار، چسب یا انتقال تصویر انجام می‌شود و بعد از مدتی از بین می‌رود. تتو دارای انواع مختلفی است که بر اساس سبک، طرح، رنگ، محل و معنی آن‌ها می‌توان آن‌ها را تفکیک کرد. برخی از انواع رایج تتو عبارتند از:

تتو سنتی: این نوع تتو با استفاده از رنگ‌های روشن و طرح‌های ساده و خطوط ضخیم انجام می‌شود. معمولاً شامل تصاویری مانند قلب، ستاره، پرچم، گل، حیوانات و غیره است. این نوع تتو از قدیمی‌ترین و محبوب‌ترین انواع تتو است.
تتو جاپنی: این نوع تتو با استفاده از رنگ‌های تیره و طرح‌های پیچیده و جزئیات زیاد انجام می‌شود. معمولاً شامل تصاویری مانند اژدها، ماهی کوی، گل‌های لوتوس، سامورایی، ژئیشا و غیره است. این نوع تتو از فرهنگ و اسطوره‌های ژاپن الهام گرفته است و معانی عمیقی دارد.
تتو سیاه و سفید: این نوع تتو با استفاده از رنگ سیاه و بدون رنگ‌های دیگر انجام می‌شود. معمولاً شامل طرح‌هایی مانند حروف، اعداد، نقشه‌ها، عکس‌ها، طرح‌های هندسی و غیره است. این نوع تتو برای کسانی که دوست دارند طرح‌های ساده و زمان‌بندی داشته باشند مناسب است.
تتو رنگی: این نوع تتو با استفاده از رنگ‌های مختلف و روشن انجام می‌شود. معمولاً شامل طرح‌هایی مانند گل‌ها، پروانه‌ها، طیف‌ها، کارتون‌ها، آثار هنری و غیره است. این نوع تتو برای کسانی که دوست دارند طرح‌های شاد و رنگین داشته باشند مناسب است.
تتو سه بعدی: این نوع تتو با استفاده از تکنیک‌های خاص و افکت‌های نوری انجام می‌شود. معمولاً شامل طرح‌هایی مانند جواهرات، زخم‌ها، سوراخ‌ها، حیوانات و غیره است. این نوع تتو برای کسانی که دوست دارند طرح‌های واقع‌گرایانه و تاثیرگذار داشته باشند مناسب است.""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "07:25" + " " + Strings.am_str),
    ArticleManagementPageAwaitingConfirmationModel(
        idArticleUr: "3",
        imageArticleUr: Address.Img_types_of_houses_Managemen_page,
        titleArticleUr: "انواع مدل خانه",
        writerProfilePhotoUr: Address.Img_writer_of_managing_articles,
        PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
        readingTime: "8",
        ContentArticleUr:
            """ مدل های خانه به شکل، سبک، طراحی و معماری خانه اطلاق می‌شود که بر اساس نیازها، سلیقه‌ها، فرهنگ‌ها و شرایط آب و هوایی متفاوت است. برخی از انواع مدل های خانه عبارتند از:

خانه سنتی: خانه‌ای که از مصالح محلی و با رعایت سنن و آداب محلی ساخته شده است. این خانه‌ها معمولا دارای حیاط، ایوان، بام، آب‌انبار و سرداب هستند. این خانه‌ها با توجه به آب و هوای منطقه، شکل و اندازه مختلفی دارند. برای مثال، خانه‌های سنتی کرمان، یزد، اصفهان، کاشان، تبریز و شیراز.
خانه مدرن: خانه‌ای که از مصالح جدید و با استفاده از تکنولوژی و مهندسی پیشرفته ساخته شده است. این خانه‌ها معمولا دارای خطوط ساده، رنگ‌های روشن، پنجره‌های بزرگ، فضاهای باز و روشنایی زیاد هستند. این خانه‌ها با توجه به سلیقه و نیازهای مالکان، شکل و اندازه مختلفی دارند. برای مثال، خانه‌های مدرن تهران، کرج، شمال، شیراز و اصفهان.
خانه اکولوژیک: خانه‌ای که با هدف کاهش تأثیرات منفی بر محیط زیست و افزایش بهره‌وری انرژی ساخته شده است. این خانه‌ها از مصالح طبیعی و بازیافتی، سیستم‌های انرژی تجدیدپذیر، فیلترهای آب و هوا، سیستم‌های کشاورزی و باغچه‌های سبز استفاده می‌کنند. این خانه‌ها با توجه به شرایط محلی، شکل و اندازه مختلفی دارند. برای مثال، خانه‌های اکولوژیک تهران، مشهد، اردبیل، کرمانشاه و بوشهر.""",
        writersName: "بانوی سبز",
        whatTimeOfDay: "07:34" + " " + Strings.am_str),
        */
  ];
}
