import 'package:techno_saz/models/data_models.dart';
import 'package:techno_saz/res/paths.dart';
import 'package:techno_saz/res/strings.dart';

List<ArticleBookmarkedPage> ArticlePageModelList = [
  ArticleBookmarkedPage(
      idArticleUr: "1",
      imageArticleUr: Adress.artc_img_Bokmrk_one,
      titleArticleUr: "نقش هوش مصنوعی و اهمیت آن در سیستم های حسابداری",
      writerProfilePhotoUr: Adress.writersImageOne,
      PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
      readingTime: "5" + Strings.minutes,
      ContentArticleUr: """هوش مصنوعی و آینده حسابداری
همانطور که گفته شد، هوش مصنوعی در تمامی فعالیت‌‌ها، از جمله در فعالیت ‌هایی که نیاز به دقت و سرعت زیاد جهت انجام امور دارند، کاربرد بسیار زیاد دارد. حسابداری و امور مالی یکی از این نوع فعالیت‌ها می‌باشد که انجام امور مالی باید با دقت و سرعت فراوانی انجام گیرد. لذا هوش‌مصنوعی در حسابداری کاربرد زیادی دارد و با به کار بردن هوش‌مصنوعی، آینده حسابداری پیشرفت فراوانی خواهد داشت.

آینده حسابداری با هوش مصنوعی
با به کارگیری هوش‌مصنوعی در حسابداری، تمامی کارها با دقت و سرعت بسیار بالایی انجام می گیرد. در نتیجه آینده حسابداری با هوش مصنوعی دچار تغییر و تحول بسیاری خواهد شد.

با استفاده از هوش‌مصنوعی، حسابداران مجبور نخواهند بود که کارهای سخت و محاسباتی را به صورت دستی انجام دهند، بلکه همه این کارها و تجزیه و تحلیل‌ها بااستفاده از هوش مصنوعی انجام خواهد گرفت که این امر باعث افزایش بهره‌‌وری و کاهش هزینه‌ها خواهد شد.

همچنین حسابداران وقت آزاد بیشتری خواهند داشت و می توانند تمرکز و تلاش بیشتری را در کارهای مهم که باعث رشد و موفقیت شرکت می‌شود، داشته باشند.

5 سوال رایج در حوزه هوش مصنوعی حسابداری
تا اینجا با مفهوم هوش مصنوعی و کاربرد آن در حسابداری و امور مالی آشنا شدید. با توجه به اهمیت هوش‌مصنوعی در حسابداری و همچنین به دلیل سوالات زیاد ایجاد شده در این زمینه، در این بخش از مقاله قصد داریم به چند سوال رایج در حوزه هوش‌مصنوعی و حسابداری پاسخ دهیم.

1- نقش هوش‌ مصنوعی در حسابداری شرکت‌ها چیست؟
یکی از سوالات مهم و پرتکرار این است که نقش هوش‌مصنوعی در حسابداری چیست؟ هوش‌مصنوعی در حسابداری کاربرد زیادی دارد. مهمترین نقش هوش مصنوعی‌در حسابداری شرکت‌ها، انجام کارها با سرعت و در عین حال با دقت فراوان می باشد. در نتیجه باعث کاهش خطاها و افزایش بهره ‌وری و به طور کلی باعث کاهش هزینه‌‌ها و افزایش درآمد در شرکت‌‌ها می‌شود.""",
      likedArticleUr: "250",
      commentArticleUr: "8",
      writersName: "سنا عزیزی"),
  ArticleBookmarkedPage(
      idArticleUr: "2",
      imageArticleUr: Adress.artc_img_Bokmrk_tow,
      titleArticleUr: "رقص باله",
      writerProfilePhotoUr: Adress.writersImageTwo,
      PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
      readingTime: "15" + Strings.minutes,
      ContentArticleUr:
          """باله تجلی افسانه ای حرکت و هنر در دنیای رقص است که مدت هاست مهم و محترم شمرده شده و هنوز هم رویاپردازان بی شماری را به فضای فوق العاده رقابتی اش دعوت می کند. مزایای کلاس های باله کودکان به بچه ها و دانش آموزان نوجوان از آن چه فکر می کنید بیشتر است. اگر کودکتان دوست دارد رقص باله یاد بگیرد، مهم است که یک کلاس باله کودکان که به صورت اصولی این رقص را آموزش می دهند پیدا کنید تا آجرهای اولیه آموزش کودکتان درست چیده شوند.
رقص باله چیست؟
باله یکی از قدیمی ترین و هنری ترین اشکال رقص است و تاریخچه غنی ای دارد. این رقص برای نخستین بار در عصر رنسانس ایتالیا طی قرن ۱۵ ظهور کرد و فرانسه و روسیه تکنیک هایش را پرورش دادند. همچنین واژه باله فرانسوی بوده و از واژه ایتالیایی «بالتو» برگرفته شده که به معنای رقصیدن است. باله در قرن ۲۰ام جهانی شد و به فرهنگ های کشورهای سراسر دنیا پا گذاشت.
سبک های گوناگون باله
سبک های قدیمی رقص باله مانند باله فرانسوی، ایتالیایی، و روسی تحت تاثیر جغرافیا بودند. اما تکنیک های جدیدتر مانند باله نئوکلاسیک و معاصر از ترکیب باله کلاسیک و روش های گوناگون رقص به وجود آمده اند. عصر رمانتیک آغازگر اجراهای زیاد سبک باله رمانتیک قرن نوزدهم بود.
رقاصان باله که بالرینا نام داشتند «توتو»های سنتی می پوشیدند و معمولا در نقش فرشتگان سحرآمیز افسون گر قلب مردان ظاهر می شدند.  تکنیک پوینت یا ایستادن روی نوک انگشتان پا، حرکات دقیق بدن، و احساسات زیاد وجه تمایز این سبک است. «لا سیلفید» و «کوپلیا» دو باله رمانتیک معروف هستند.
رقص باله کلاسیک
اصطلاحات و روش های باله کلاسیک سبک های فرانسوی، ایتالیایی، و روسی را جدا کرده است. همچنین فندق شکن و دریاچه قو از معروف ترین باله های چایکوفسکی هستند.
""",
      likedArticleUr: "130",
      commentArticleUr: "78",
      writersName: "علی شجاعی"),
  ArticleBookmarkedPage(
      idArticleUr: "3",
      imageArticleUr: Adress.artc_img_Bokmrk_three,
      titleArticleUr: "شناخت انواع قهوه و روش های دم آوری قهوه",
      writerProfilePhotoUr: Adress.writersImageThree,
      PublicationDateArticleUr: "9" + "  " + Strings.daysAgo_str,
      readingTime: "20" + Strings.minutes,
      ContentArticleUr:
          """دم آوری قهوه که جز برترین و بهترین نوشیدنی های جهان به حساب می آید و از معدود نوشیدنی هایی می باشد که در سرتاسر جهان شناخته شده است بسیار مهم می باشد. نحوه دم کردن قهوه با ابهامات و سوالات فراوانی همراه است که شاید جالب باشه بدونید که خیلی از باریستاهای کافی شاپ ها نیز آن را به درستی بلد نیستند!
برای دم آوری قهوه وسایل و روش های گوناگونی وجود دارد که می توان آنها را در سه دسته بندی اصلی را تقسیم کرد:    1. روش غوطه وری یا همجواری (Immersion) 2. روش خیساندن یا پور اور (Pour over) 3. تحت فشار یا اکسترکشن (Pressure).
اگر جز افراد مبتدی هستید لطفاً از این واژه ها نترسید چون ما سعی خواهیم کرد که به ساده ترین روش ممکن روش های دم کردن قهوه را برای شما معرفی کنیم، خیالتون راحت!  و اگر مفاهیم اولیه را متوجه نشدید، در انتهای مقاله روش های عملی رو توضیح دادیم برای شما دوست عزیز.
اگر بخواهیم به طور ساده این روش که اصلی ترین روش تهیه دم آوری قهوه است بازگو کنیم باید بگوییم، روش غوطه وری به این معنی است که قهوه آسیاب شده کاملا در آب غرق می شود و سپس این آب در طول زمان، عمل عصاره گیری قهوه را انجام می‌‌دهد.
روش غوطه وری یا همجواری را می‌‌توان یک روش بدون مداخله مستقیم در دم کردن دانست، و کافیست شما فقط آب را اضافه کنید و منتظر بمانید، چقدر؟ 4 الی 5 دقیقه که تقریبا زمان استاندارد برای تهیه قهوه های مختلف به حساب می آید.
رایج ترین  نوع دم کردن قهوه به روش غوطه وری استفاده از فرنچ پرس است. فرنچ پرس برای تهیه قهوه فرانسه استفاده می شود که قبلاً به طور کامل آموزش دادیم برای شما.
قهوه ترک دومین روش رایج دم آوری قهوه با استفاده از روش همجواری می باشد که در بین ما ایرانی ها نیز خیلی محبوبه. بسیاری از روش‌های دم سرد قهوه (کلدبرو)  و قهوه ساز کلور که شامل خیس خوردن طولانی مدت قهوه می باشند نیز جز این روش میباشند.
می توان گفت تقریبا همه روش‌های غوطه وری دم کردن قهوه به فیلتر کردن هم نیاز دارند. دلیل آن هم این است که در این روش ها تفاله هایی باقی می مانند و  هر فیلتری که استفاده شود، وظیفه حذف تفاله‌های قهوه و ریزترین ذرات موجود در نوشیدنی نهایی را بر عهده دارند.
البته برای قهوه ها و روش های مختلف نوع فیلتر استفاده شده متفاوت است برای مثال، فرنچ پرس از فیلتر فلزی استفاده می‌‌کند در حالی که فیلتر کلور کاغذی است و یا قهوه ترک اصلاً فیلتری ندارد.
دقت کنید در دم کردن قهوه به روش همجواری هرچه زمان میگذرد، سرعت عصاره گیری کم می‌‌شود. این اتفاق به این دلیل است که، همانطور که مواد جامد قهوه در آب حل می‌‌شوند نوشیدنی شما بیشتر و بیشتر اشباع می‌‌شود.
پس یادتان باشد قهوه فرانسه، قهوه ترک، قهوه کلد برو و قهوه کلور همگی با استفاده از روش غوطه وری عصاره گیری می شوند و در ادامه مقاله تک تک آنها را یک توضیح مختصر خواهیم داد که چی هستند ولی به طور کلی 37 روش برای درست کردن قهوه وجود دارد.
""",
      likedArticleUr: "456",
      commentArticleUr: "16",
      writersName: "رضا شفیعی"),
  ArticleBookmarkedPage(
      idArticleUr: "4",
      imageArticleUr: Adress.artc_img_Bokmrk_four,
      titleArticleUr: "کمبود محبت پدر چه نشانه هایی دارد؟",
      writerProfilePhotoUr: Adress.writersImageFour,
      PublicationDateArticleUr: "8" + "  " + Strings.daysAgo_str,
      readingTime: "6" + Strings.minutes,
      ContentArticleUr:"""دختری که در شرایط خانوادگی ناسالم به دنیا می آید و در همان جا نیز پرورش پیدا می کند قطعا تجربیات متفاوتی را مشاهده می کند. مثلا پدر و مادرش همواره در حال جنگ و دعوا هستند و هیچ مهر و محبتی بین آنها وجود ندارد. چنین دختری هرگز امنیت روانی و عاطفی را تجربه نمی کند و همین موضوع باعث می شود تا تمامی ابعاد زندگی اش تحت تاثیر قرار بگیرد.
به همین دلیل لازم است بدانیم که پدر و مادر تاثیر مستقیمی بر روی سلامت روان فرزندان دارند. از این رو اگر آنها نتوانند نیازهای روانی فرزندانشان را تامین کنند در آینده نتیجه چنین فقدانی را مشاهده می کنند.
دختران و پسرانی که در دوران کودکی از سمت والدین خود هیچ گونه محبتی را دریافت نمی کنند در طول زندگی شان رفتارهای متفاوتی را از خودشان نشان می دهند. به عنوان مثال پسرانی که از سمت والدین مورد بی مهری قرار گرفته اند همواره دارای رفتار پرخاشگرانه ای هستند.
با این که ممکن است از نظر تحصیلات به درجات خوبی دست پیدا کنند اما به دلیل کمبود محبتی که از سمت والدین تجربه کرده اند از نظر سلامت روان دچار مشکل هستند و نمی توانند رابطه خوب و سالمی با دیگران برقرار کنند.
تاثیر کمبود محبت پدر بر روی روابط عاطفی
همانطور که می دانید پدر اولین جنس مخالفی است که با دختر خودش ارتباط برقرار می کند. از این رو مهم ترین نقش را در روابط عاطفی و احساسی دختر خویش بازی می کند.
به یاد داشته باشید تمام دخترانی که از سمت پدرشان مورد بی مهری قرار گرفته اند و پدرشان به آنها محبت نکرده باشد زمانی که به سن بلوغ می رسند نمی توانند رابطه سالم و خوبی با جنس مخالف داشته باشند. برای آموزش بیشتر به کارگاه آموزش فرزندپروری مراجعه فرمایید.
بنابراین باید بدانیم که بد رفتاری پدر با دختر و عیب جویی های مداوم از فرزند موجب می شود تا فرد از نظر عاطفی دچار مشکل شود و نتواند در آینده رفتارهای سالمی را از خودش بروز دهد.
محبت طلبی
کمبود برخی از عناصر مهم زندگی موجب می شود تا انسان ها در طول زندگی برای تامین آنها رفتارهای متفاوتی را از خودشان نشان دهند. از این رو باید بدانیم که اگر دختری از سمت پدرش کمبود محبت را تجربه کرده باشد همواره این احساس کمبود را با خودش همراه دارد و در بزرگسالی تلاش می کند تا از طریق جلب توجه جنس مخالف کاری کند که به او محبت شود.
پدرانی که فقط از دخترانشان عیب جویی می کنند و تمام کارهایی که دختران انجام می دهد را زیر سوال می برند باعث می شوند تا حرمت نفس یا همان عزت نفس دختران به شدت تضعیف شده و در نتیجه در دوران بزرگسالی دچار احساس خود کم بینی و عقده حقارت می شود.
همچنین پدرانی که اصلا محبت کردن را بلد نیستند و رفتاری سرد با دخترشان دارند موجب می شوند تا آنها برای جبران کمبود محبت خود به سراغ دیگران بروند. همواره در این مسیر افرادی در سر راه دختران قرار می گیرند که از او سو استفاده می کنند و در نتیجه به دلیل وجود طرحواره ها و تله های روانی همان الگوهای قدیمی را تکرار می کنند و در نتیجه بسیاری از روابط آنها دچار مشکل و آسیب می شود.
یعنی حتی اگر با فردی سالم نیز وارد رابطه شوند چون آنها مشکل کمبود محبت را با خود به همراه دارند طبق همان دوران عمل می کنند و به دلیل نوع رفتارهای ناسالمی که با فرد مقابل دارند باعث می شوند تا رابطه آنها دچار خدشه و آسیب شود.
عدم توانایی عشق ورزی
افرادی که دچار کمبود محبت پدر هستند هرگز نمی توانند معنای عشق ورزی را به خوبی بفهمند. چرا که از نظر علمی ما می دانیم که دانش و آگاهی باید به انسان داده شود تا بتواند در زمان های دیگر خروجی آن را مشاهده کنیم. محبت کردن نیز موضوعی است که فرد باید آن را تجربه کند و از والدین خودش آن را مشاهده کند.
در این صورت زمانی که خودش در رابطه با دیگران قرار می گیرد نمی توانند عشق ورزی را انجام دهد. این افراد به گونه ای عمل می کنند که وقتی به رفتار آنها توجه می کنید فکر می کنید آنها افرادی خودشیفته و خودخواه هستند. همچنین نوع رفتار آنها به شکلی است که گویی تنها مصلحت خودشان را می خواند و فقط به نیازها و خواسته های خودشان فکر می کنند.
به همین دلیل آنها توان محبت کردن به دیگران را ندارند و همواره از سمت دیگران به عنوان خودخواه و خودشیفته مورد خطاب قرار می گیرند. زمانی که آنها با فردی وارد رابطه می شوند به صورت خودخواهانه عمل می کنند و اگر همسر یا پارتنر آنها به این شرایط اعتراض کند آنها در پاسخ رفتاری پرخاشگرانه را از خودشان نشان می دهند.
مواردی که در قسمت بالا گفته شد در مورد تاثیر کمبود محبت پدر و مادر نسبت به پسران است. یعنی اگر والدین نسبت به فرزند پسر خود رفتاری سرد و بدون صمیمیت داشته باشند او در بزرگسالی به این صورت رفتار می کند. در ادامه با ما همراه باشید تا تاثیر کمبود محبت پدر را بر روی رفتار دختران مورد بررسی قرار دهیم. همچنین پیشنهاد می شود تا مقاله طرحواره تنبیه را مطالعه فرمایید.
حال اگر یک دختر در دوران کودکی از نظر عاطفی و احساسی دچار کمبود محبت باشد زمانی که بزرگ می شود نوعی رنج درونی را احساس می کند و برای جبران تمام کمبودهای گذشته دست به کارهای مختلفی می زند. این دختران به صورت ناخودآگاه برای جبران احساس غم و رنجی که در درون خود دارند اقدامات افراطی را انجام می دهند.
محبت افراطی یک طرفه
دختری که در خانواده ای سرد و بی محبت پرورش پیدا کرده است برای جبران کمبود محبت پدر و مادر خود وارد بازی کردن نقش می شود. یعنی با عروسک هایش بازی می کند و همواره نقش مادری دلسوز را به خود می گیرد که عروسک هایش را دوست دارد و با این رفتارها تلاش می کند تا کمبود محبت پدرش را جبران کند.
در این حالت زمانی که این دختر وارد رابطه عاطفی با یک پسر می شود آنقدر به او محبت و خوبی می کند که گویی مادر آن پسر است. از این رو باید بدانید که چنین دخترانی هنگامی که در دوران کودکی از سمت پدر یا مادرشان محبتی را دریافت نکرده اند دست به اقدامات افراطی می زنند. یعنی هنگامی که به رفتار آنها توجه می کنید متوجه می شوید که محبت زیادی را به دیگران می کنند و تمامی این رفتارها به صورت ناخودآگاه از او بروز می کند.
""",
      likedArticleUr: "213",
      commentArticleUr: "36",
      writersName: "علیرضا محمدی"),
  ArticleBookmarkedPage(
      idArticleUr: "5",
      imageArticleUr: Adress.artc_img_Bokmrk_five,
      titleArticleUr: "مطالعه گروهی؛ مزایا و راهکارها",
      writerProfilePhotoUr: Adress.writersImageFive,
      PublicationDateArticleUr: "7" + "  " + Strings.daysAgo_str,
      readingTime: "4" + Strings.minutes,
      ContentArticleUr:"""مطالعه گروهی چیست و انواع آن کدام است؟
هنگامی‌که تعدادی از افراد در گروه‌های کوچک مطالعه می‌کنند و نظرات خود را در مورد یک موضوع آموزشی به اشتراک می‌گذارند، به آن مطالعه گروهی می‌گویند و گروهی که به این‌ترتیب تشکیل می‌شود، گروه مطالعاتی یا گروه مطالعه نام دارد. این گروه معمولاً از افرادی تشکیل می‌شود که در یک کلاس یا در یک رشته تحصیل می‌کنند. لزومی ندارد که افراد یک گروه مطالعاتی، یکدیگر را بشناسند بلکه برای تشکیل گروه، شرکت‌کنندگان باید یک موضوع یا برنامه درسی مشترک برای مطالعه داشته‌باشند تا بتوانند نظرات خود را با یکدیگر به اشتراک بگذارند.
اعضای گروه به‌طور مرتب با یکدیگر ملاقات و در مورد موضوع مطالعه بحث می‌کنند. گروه ممکن است رسمی یا غیر رسمی باشد. گروه‌های غیررسمی توسط افرادی که یکدیگر را می‌شناسند، برای مطالعه موضوعات دشوار یا آماده‌شدن برای امتحانات تشکیل می‌شوند. در حالی‌که تشکیل گروه‌های رسمی توسط مسئولین یا اعضای هیئت علمی در مدارس و دانشگاه‌ها برای کار روی یک پروژه مشترک صورت می‌گیرد. در این نوع گروه‌ها، شرکت‌کنندگان برای تحقیق درباره یک موضوع و تهیه یک پروژه گروهی که قرار است به مدرسه یا دانشگاه ارائه شود، گرد هم می‌آیند.
مزایای مطالعه گروهی چیست؟
یک گروه‌ مطالعاتی موثر می‌تواند به دانش‌آموزان کمک کند تا مطالب درسی را به شیوه‌ای عمیق‌تر و دقیق‌تر یاد بگیرند. گروه‌هایی که موفق هستند، انرژی مثبت تولید می‌کنند، مشوق مشارکت فعال هستند و نظم و انضباط را القا می‌کنند. این مهارت‌ها برای یادگیری مهم هستند. در ادامه درباره این مزایا توضیح می‌دهیم.
""",
      likedArticleUr: "600",
      commentArticleUr: "30",
      writersName: "محسن نعمتی"),
ArticleBookmarkedPage(
      idArticleUr: "6",
      imageArticleUr: Adress.artc_img_Bokmrk_six,
      titleArticleUr: "",
      writerProfilePhotoUr: Adress.writersImageSix,
      PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
      readingTime: "7" + Strings.minutes,
      ContentArticleUr:"""""",
      likedArticleUr: "520",
      commentArticleUr: "400",
      writersName: "دنیا آسایش"),

];
