import 'package:techno_saz/models/data_models.dart';
import 'package:techno_saz/res/paths.dart';
import 'package:techno_saz/res/strings.dart';

Map homePagePosterMap = {
  "imageAsset": Adress.banner,
  "titleOnBanner": Strings.titleOnBanner,
};

List<HashTagModel> tagList = [
  HashTagModel(title: "جاوا"),
  HashTagModel(title: "کاتلین"),
  HashTagModel(title: "وب"),
  HashTagModel(title: "سلامتی"),
  HashTagModel(title: "هوش مصنوعی"),
  HashTagModel(title: "دارت"),
  HashTagModel(title: "فلاتر"),
  HashTagModel(title: "تکنولوژی"),
  HashTagModel(title: "هنر"),
  HashTagModel(title: "ورزش"),
  HashTagModel(title: "بیزنس"),
];

List<ArticlePageModel> ArticlePageModelList = [
  ArticlePageModel(
      idArticleUr: "1",
      imageArticleUr: Adress.articlesImageidOne,
      titleArticleUr: """
رژیم 15 روز تا سلامتی استاد جمشید خدادادی
""",
      writerProfilePhotoUr: Adress.writersImageOne,
      PublicationDateArticleUr: "3" + "  " + Strings.daysAgo_str,
      readingTime: "5" + Strings.minutes,
      ContentArticleUr: """
باانجام یک رژیم پانزده روزه می توانیداز بیشتر بیماریها نجات پیدا کنید و سلامتی و نشاط خود را بدست آورید و طعم سلامتی جسم و روح را بچشید!اگر رژیم پانزده روزه زیر را دقیقا انجام دهید، با نتایج خیره کننده ای مواجه شد و اثرات فوق العاده مفید آن را به چشم خواهید دید.از این رژیم برای لاغری و تناسب اندام نیز می توان استفاده کرد.با این رژیم، در عرض پانزده روز حدود 4 تا 5 کیلو گرم وزن کم خواهید کرد و پوستی روشن و چهره ای با نشاط پیدا خواهید نمود. و مهمتر از همه، آرامش جالب و خواب عمیق و راحتی پیدا خواهید کرد و از زندگی لذت خواهید برد. حسن این رژیم این است که از غذاهای متنوعی برخوردار است و هر روز غذای مخصوصی میل خواهید کرد؛ زیرا تنوع در غذا باعث می شود که کلیه مواد غذایی لازم به بدن برسد و انسان از فقر غذایی نجات پیدا کند و از مغزی فعال و روانی سالم و جسمی سبک برخوردار شود. امید است با رعایت موارد ذیل سلامتی و نشاط را برای خود به ارمغان بیاورید. افرادی که دچار یبوست مزاج هستند نیز می توانند توصیه های زیر را دقیقا انجام دهند تا از این معضل که خود ام الامراض است نجات پیدا کنند.
 """,
      likedArticleUr: "65",
      commentArticleUr: "5",
      writersName: "هری پاتر"),
  ArticlePageModel(
      idArticleUr: "2",
      imageArticleUr: Adress.articlesImageidTwo,
      titleArticleUr: """
عسل دارویی چیست و چه تفاوتی با عسل معمولی دارد؟
""",
      writerProfilePhotoUr: Adress.writersImageTwo,
      PublicationDateArticleUr: "2" + "  " + Strings.daysAgo_str,
      readingTime: "10" + Strings.minutes,
      ContentArticleUr: """
عسل دارویی یا عسل طبی اهمیت زیادی برای بدن انسان دارد. این نوع عسل به عنوان یک ملین خفیف، سوء هاضمه و عفونت های روده ای، درمان بسیاری از ناراحتی های معده از جمله یبوست محسوب می شود. عسل دارویی دارایی ویژگی هایی است که آن را از عسل معمولی متمایز می کند.

در واقع عسل یک ماده غذایی طبیعی با طعم شیرین با بافت چسبناک است. زنبورها این عسل را از شهد گلها که ترشحات شیرین گیاهی است تولید می کنند.

این کار از طریق فرآیندهای مرتب انجام می شود و شکل نهایی پس از تبخیر آب به وجود می آید و عسل در ساختارهایی که به ساختارهای مومی معروف هستند ذخیره می شود و به این ساختارها لانه زنبوری می گویند.

همچنین زنبورها یک نوع عسل تولید نمی‌کنند، بلکه انواع زیادی را تولید می‌کنند که از نظر رنگ، طعم و بو متفاوت است، همه بر اساس منبع غذای زنبور عسل.

به دلیل افزایش تقاضا برای عسل به دلیل خواص و فواید فراوان، مقادیر زیادی زنبور عسل در سراسر جهان پرورش می‌یابد. در این مقاله به خواص عسل دارویی می پردازیم.

تفاوت عسل دارویی با عسل معمولی چیست؟
خواص درمانی عسل تا حدود زیادی به منبع گلی بستگی دارد که زنبورها شهد و گرده را از آن برداشت می کنند. یکی از دلایلی که عسل دارویی را از دیگر عسل ها متمایز می کند منشا گل آن است.

عسل دارویی به طور طبیعی کدرتر از عسل معمولی است؛ زیرا بقایای لانه زنبوری آنقدر کوچک است که فیلتر نمی شود.

همچنین این عسل نسبت به عسل معمولی از نظر رنگ و بافت تنوع بیشتری دارد. رنگ عسل طبی ممکن است بسته به گل هایی که زنبورها گرده افشانی کرده اند، تغییر کند. برخی مطالعات نشان می دهد که عسل دارویی ممکن است فواید سلامتی بیشتری نسبت به عسل معمولی داشته باشد.

انواع عسل دارویی
عسل با توجه به منابع شهد گلی که زنبورها از آن تغذیه می کنند متفاوت است و بر این اساس انواع عسل به شرح زیر طبقه بندی می شوند:

عسل تک گل
عسل تک گل انواع زیادی دارد و این انواع از نظر رنگ و طعم با هم تفاوت دارند، زنبورداران برای تولید عسل تک رنگ، کندوها را در مکانی نگهداری می کنند که زنبورها فقط برای یک نوع گل از آن عبور کنند.

عسل چند گل
عسل چند گل یا عسل گل وحشی از انواع مختلف گل ها استخراج می شود.

عسل مخلوط
این عسل از اختلاط انواع عسل تهیه می‌شود و انواع عسل‌هایی که مخلوط شده‌اند از نظر رنگ، طعم، تراکم، منشاء جغرافیایی و منبع گل متفاوت هستند.
 """,
      likedArticleUr: "84",
      commentArticleUr: "78",
      writersName: "اَ.ویلسون"),
  ArticlePageModel(
      idArticleUr: "3",
      imageArticleUr: Adress.articlesImageidThree,
      titleArticleUr: """
کنترل همروندی چیست؟ 
""",
      writerProfilePhotoUr: Adress.writersImageThree,
      PublicationDateArticleUr: "4" + "  " + Strings.daysAgo_str,
      readingTime: "14" + Strings.minutes,
      ContentArticleUr: """
در فناوری اطلاعات و علوم رایانه‌ای، به‌خصوص در شاخه‌های برنامه‌نویسی رایانه‌ای، سیستم عامل، چندپردازشی، و پایگاه‌داده‌ها، کنترل همروندی (به انگلیسی: Concurrency Control)، از نتایج تولید شده ناشی از عملیات هم‌زمان اطمینان حاصل کرده، درحالی که سعی می کند در سریع ترین زمان ممکن به نتایج برسد.
سیستم‌های رایانه‌ای، چه نرم‌افزاری و چه سخت‌افزاری، شامل ماژول‌ها یا مؤلفه‌هایی اند. هر مؤلفه به گونه‌ای طراحی شده که به طرز صحیحی عمل کند، یعنی، از قوانین سازگاری بخصوصی تبعیت نموده، یا با آن ها تطابق داشته باشند. هنگامی که مؤلفه‌های هم‌روند با یکدیگر به وسیله پیام‌دهی یا اشتراک‌گذاری داده‌های دسترسی شده برهمکنش کنند (در حافظه یا محل ذخیره‌سازی)، هم‌روندی برخی از مؤلفه‌ها ممکن است توسط مؤلفه‌های دیگری مورد تجاوز و تخطی قرار گیرد. به طور کلی، مبحث هم‌روندی به ارائه قواعد، روش‌ها، روش‌شناسی‌های طراحی و نظریاتی می پردازد که به حفظ سازگاری مؤلفه‌های هم‌روندی، طی اجرای عملیاتشان کمک کند؛ بدین طریق سازگاری و صحت کل سیستم حفظ خواهد شد. معرفی کنترل هم‌روندی به یک سامانه، به معنای اعمال محدودیت‌های عملیاتیست که اغلب منجر به کاهش یافتن برخی از کارایی‌های سامانه می گردد. دستیابی به سازگاری عملیاتی و صحت باید تا حد امکان همراه با بهره‌وری باشد، به گونه‌ای که کارایی از حد معقول خاصی کمتر نشود. ممکن است کنترل همروندی در مقایسه با الگوریتم‌های سری (Sequential Algorithms) (که ساده‌ترند) نیازمند افزودن به پیچیدگی و سربار در قالب یک الگوریتم همروندی باشد.
به عنوان مثال، شکست در کنترل هم‌روندی، ممکن است منجر به خراب‌شدن داده‌ها شود، که ناشی از گسست عملیات خواندن یا نوشتن است.
 """,
      likedArticleUr: "96",
      commentArticleUr: "23",
      writersName: "شایرا"),
  ArticlePageModel(
      idArticleUr: "4",
      imageArticleUr: Adress.articlesImageidFour,
      titleArticleUr: """
هوش احساسی چیست؟
""",
      writerProfilePhotoUr: Adress.writersImageFour,
      PublicationDateArticleUr: "5" + "  " + Strings.daysAgo_str,
      readingTime: "13" + Strings.minutes,
      ContentArticleUr: """
در ابتدا بهتر است یک تعریف کلی از هوش هیجانی ارائه کنیم. هوش احساسی یا هوش هیجانی به انگلیسی Emotional Intelligence، به توانایی شناسایی و مدیریت احساسات خود و احساسات دیگران اشاره دارد. در واقع هوش هیجانی به معنای توانایی مهار احساسات و به کار بردن آنها در کارهایی مانند تفکر و حل مسئله است.

امروزه از هوش هیجانی به عنوان یکی از مؤلفه‌های ذاتی موفقیت در افراد یاد می‌شود. پیش‌بینی و درک رفتار دیگران به ما کمک می‌کند تا در مواقع ضروری بهترین تصمیم را بگیریم. بنابراین مهم است که بدانیم هوش عاطفی چیست و چه مؤلفه‌هایی را در برمی‌گیرد؟

توانایی درک احساسات دیگران و مدیریت احساسات خود می‌تواند منجر به کاهش استرس، برقراری ارتباط موثر، همدلی با دیگران، غلبه بر چالش‌ها و خنثی کردن تعار‌ض‌ها شود. هوش عاطفی یا ای کیو به شما کمک می‌کند تا روابط قوی‌تری ایجاد کنید، در مدرسه و محل کار موفق شوید و به اهداف شغلی و شخصی خود برسید. همچنین به شما کمک می‌کند تا با احساسات خود ارتباط برقرار کنید و تصمیمات آگاهانه‌ای در مورد آنچه برای شما مهم است بگیرید.  

ریشه های تئوری هوش هیجانی (هوش هیجانی در روانشناسی)
اگر بخواهیم تاریخچه هوش هیجانی را به زبان ساده بازبینی کنیم، تئوری هوش هیجانی توسط پیتر سالووی و جان دی مایر در دهه ۱۹۹۰ معرفی شد و به وسیله دانیل گولمن بیشتر توسعه یافت و به عموم مردم ارائه شد. به گفته گلمن، هوش عاطفی بزرگ‌ترین پیش‌بینی‌ کننده موفقیت در محیط کار است. این مفهوم که به عنوان ضریب احساسی یا EQ نیز شناخته می‌شود، در سال‌های اخیر بیشتر مورد توجه قرار گرفته و مقبولیت گسترده‌ای در بین روانشناسان پیدا کرده است.

با این حال، برخی از روانشناسان معتقدند از آنجایی که EQ را نمی‌توان از طریق آزمون‌های روان سنجی مثل انواع تست هوش عمومی مورد ارزیابی قرار داد، این مفهوم فاقد قدرت توضیحی واقعی است. اما برادبری و گریوز توانستند با طرح پرسشنامه‌ای، این مشکل را حل کنند و توانایی ارزیابی آن را نیز به دست آورند. ادوارد تورندایک از روانشناسانی است که در حوزه هوش احساسی تحقیقاتی انجام داد و به نتایجی در مورد اثبات وجود آن دست یافت.

دکتر بار-ان از دیگر افرادی بود که حدود ۲۰ سال از وقت خود را صرف معرفی شیوه‌ای برای اندازه‌گیری EI کرد. بار-ان در طول این مدت مطالعاتی را بر روی بیش از ۱۱۰۰۰۰ نفر در سراسر جهان انجام داد. تست ای کیو بار-ان (آزمون هوش هیجانی بار آن) رفتار هوش هیجانی و اجتماعی را اندازه‌گیری می‌کند. این تست ۱۳۳ آیتم را بر اساس پنج شاخص مورد بررسی قرار می‌دهد.
 """,
      likedArticleUr: "84",
      commentArticleUr: "14",
      writersName: "وانتونز"),
];
